extends Node2D
@onready var text_list: VBoxContainer = $BG / InfoBg / ScrollContainer / TextList
@onready var bb: Label = $BG / InfoBg / BB

var VerisionsName: String = "V1_3"
var Verisions: String = "V1.3"
var TextList = {
	"V1_3": [
		"因本次更新改动，新增内容较多，此处展示的内容可能包揽不全，请理解！", 
		"本作由夜舞Arsura沿着八荒湮隳1.2.0.1继续制作，和樱花版本有差异还请谅解！", 
		"", 
		"一、版本新增内容：==============================", 
			"1.新增头衔：后羿头衔，挑战后羿本可无限挑战。", 
			"2.关卡开放至截教篇。", 
			"3.新增日常任务机制：完成任务目标可以领取相应的奖励。", 
			"4.新增流沙河副本：可以挑战邪角色，掉落流邪符石合成渊邪。", 
			"5.新增法宝渊邪：使用法宝可增加60暴击和50%伤害提升。", 
			"6.新增五系法宝五毒兽：开启五毒兽技能。", 
			"7.新增大量道具：可通过特殊方式获得。", 
			"8.螺旋地狱开启：挑战Boss获取五毒印记。", 
			"", 
			"二、游戏优化：==================================", 
			"1.优化怪物死亡后灵魂生成动画及灵魂追不上玩家的问题。", 
			"2.Buff机制重做，优化同类buff图标堆叠问题，现在buff图标不再一味的向后叠加，而是显示对应叠加层数。", 
			"3.对部分特效错位问题进行了调整。", 
			"4.物品属性图重做，字体，颜色进行了修改。", 
			"5.现在物品格点击过快会失效，请不要点击过快或使用连点器。", 
			"6.优化角色死亡动画。", 
			"7.部分关键部位增加确定框，避免出现误触。", 
			"8.人物，装备，怪物数值全部重做。", 
			"9.物品属性图显示超出屏幕右侧将会移至左侧显示。", 
			"10.对部分模糊素材清晰度进行优化。", 
			"11.优化部分字体。", 
			"12.孟婆无限召唤作为机制保留。", 
			"13.悟空最后一击攻击间隔缩短，普攻能无限连太变态了，到时候没体验别赖我。", 
			"14.90%以上Boss掉率可以做到使用双倍必掉。", 
			"", 
			"三、问题修复：==================================", 
			"1.修复角色猪八戒技能升级的问题，这个问题曾导致：升级旋滚球技能等级会提升地滚球伤害。", 
			"2.修复法宝白霜镜索敌过程中，目标消失自身会卡住的问题。", 
			"3.修复使用孟婆药剂会将未学习技能等级也重置为1的问题。", 
			"4.修复唐僧使用水幻影，回血回魔变为双倍的问题。", 
			"5.修复属性图可能显示错误信息的问题。", 
			"6.修复曼珠，沙华相互回血时，可以复活的Bug。", 
			"7.修复Boss阎罗王【三道鬼门】在被施加控制类效果时，失去弱霸体效果的问题。", 
			"", 
			"四、删除：==================================", 
			"1.永久删除战斗力功能，同步删除关卡信息推荐战斗力。", 
			"2.永久删除难度选择功能。", 
			"3.商城删除部分商品。", 
			"4.嗜血狂鲨不再掉落强化石，红孩儿不再掉落强化石宝箱。", 
			"", 
			"五、调整：==================================", 
			"1.商城可购买更多翅膀道具。", 
			], 
	"V1_3_1": [
		"因本次更新改动，新增内容较多，此处展示的内容可能包揽不全，请理解！", 
		"本作由B站Up主：夜舞Arsura沿着八荒湮隳1.2.0.1继续制作，和樱花版本有差异还请谅解！", 
		"", 
		"一、版本新增内容：==============================", 
			"1.任务新增日常任务：至尊宝。", 
			"2.新时装：至尊宝，六耳猕猴(暂时无法获取)装回归。", 
			"3.新开放角色：沙僧。", 
			"", 
			"二、游戏优化：==================================", 
			"1.绝大多数数值问题已同步八荒1.2。", 
			"", 
			"三、问题修复：==================================", 
			"1.修复几乎大部分贴图bug。", 
			"2.修复背包装备空格子bug。", 
			"3.修复渊邪无增伤效果。", 
			"4.修复五毒兽和渊邪不计算冷却bug。", 
			"5.修复九龙岛花豹掉落制作书数量为0的bug。", 
			"6.修复牛魔王震动时角色如果死亡会闪退的bug。", 
			"8.修复头衔不在幻化界面的bug。", 
			"9.修复天荒装备后无动画的bug。", 
			"10.修复截教九龙岛小怪无伤害的bug。", 
			"11.修复枯叶铲无法合成枯叶灵的bug。", 
			"", 
			"四、删除：==================================", 
			"1.千里眼不再爆枯叶弓，在沙僧弓系实装后回归。", 
			"", 
			"五、调整：==================================", 
			"1.唐僧水魔爆伤害数值加强。", 
			"2.螺旋地狱平等王血量增加只80w。", 
			"3.截教小怪攻击数值增强。", 
			"4.显著地降低了流沙河邪沙僧的闪避概率。", 
			], 

	"V1_3_2": [
		"因本次更新改动，新增内容较多，此处展示的内容可能包揽不全，请理解！", 
		"本作由B站Up主：夜舞Arsura沿着八荒湮隳1.2.0.1继续制作，和樱花版本有差异还请谅解！", 
		"", 
		"一、版本新增内容：==============================", 
			"1.新增小白龙传说防具：天龙。", 
			"2.新开放角色：小白龙。", 
			"", 
			"二、游戏优化：==================================", 
			"1.全面同步八荒1.2。", 
			"", 
			"三、问题修复：==================================", 
			"1.修复几乎大部分贴图bug。", 
			"2.修复背包装备空格子bug。", 
			"3.修复渊邪无增伤效果。", 
			"4.修复五毒兽和渊邪不计算冷却bug。", 
			"5.修复九龙岛花豹掉落制作书数量为0的bug。", 
			"6.修复牛魔王震动时角色如果死亡会闪退的bug。", 
			"8.修复头衔不在幻化界面的bug。", 
			"9.修复天荒装备后无动画的bug。", 
			"10.修复截教九龙岛小怪无伤害的bug。", 
			"11.修复枯叶铲无法合成枯叶灵的bug。", 
			"", 
			"四、删除：==================================", 
			"1.千里眼不再爆枯叶弓，在沙僧弓系实装后回归。", 
			"", 
			"五、调整：==================================", 
			"1.调整五角色传说防具的数值，目前都会加少量攻击力。", 
			], 
	"V1_3_3": [
		"因本次更新改动，新增内容较多，此处展示的内容可能包揽不全，请理解！", 
		"本作由B站Up主：夜舞Arsura沿着八荒湮隳1.2.0.1继续制作，和樱花版本有差异还请谅解！", 
		"", 
		"一、版本新增内容：==============================", 
			"1.新增截教天境关卡龙脊山。", 
			"2.新增截教天境关卡尾妖林。", 
			"3.新增截教天境关卡仙音岛。", 
			"4.新增截教天境关卡仙幻岛。", 
			"5.新增截教天境关卡仙树岛。", 
			"6.新增传说饰品：花宴，受邪灵饰品影响", 
			"7.新增三个邪灵饰品：破幻花链。镇魂花坠，不朽花翼", 
			"8.新增玩家角色技能升级，最高到10级，蓝耗极高，谨慎考虑。", 
			"9.新增魂器，传说品质射日英雄", 
			"", 
			"二、游戏优化：==================================", 
			"1.修正部分与实际效果不符的文本", 
			"", 
			"三、问题修复：==================================", 
			"1.修复小白龙不掉白装的bug。", 
			"2.修复紫金葫芦贴图显示不正确的bug。", 
			"", 
			"四、删除：==================================", 
			"1.暂无。", 
			"", 
			"五、调整：==================================", 
			"1.调整五角色传说防具制作书爆率地点移步至尾妖林。", 
			], 
}
func _ready() -> void :
	ADDTextInfo()

func ADDTextInfo():
	RemoveAllTextInfo()
	bb.text = str(Verisions) + "更新详情"
	if VerisionsName == "" or VerisionsName == null:
		return
	for i in TextList[VerisionsName]:
		Global.ADDFont_(text_list, i, "res://Font/华康海报体W12 &amp; 华康海报体W12(P).ttc", 17, "FFFFFF", 10, "000000")

func RemoveAllTextInfo():
	for i in text_list.get_children():
		i.queue_free()

func _on_v_1_3_pressed() -> void :
	VerisionsName = "V1_3"
	Verisions = "V1.3"
	ADDTextInfo()

func _on_v_1_3_1_pressed() -> void :
	VerisionsName = "V1_3_1"
	Verisions = "V1_3_1"
	ADDTextInfo()


func _on_close_pressed() -> void :
	queue_free()


func _on_v_1_3_2_pressed() -> void :
	VerisionsName = "V1_3_2"
	Verisions = "V1.3.2"
	ADDTextInfo()


func _on_v_1_3_3_pressed() -> void :
	VerisionsName = "V1_3_3"
	Verisions = "V1.3.3"
	ADDTextInfo()


func _on_v_0_5_pressed() -> void :
	VerisionsName = "V1_2_0_1"
	Verisions = "V1.2.0.1"
	ADDTextInfo()
