extends RefCounted

const DIFFICULTY_MULTIPLIERS = [1.0, 2.0, 3.0, 3.0]

const DATA = {
	"xh": {
		"名字": "小猴子", 
		"等级": 5, 
		"生命": 60, 
		"攻击间隔": 90, 
		"物防": 50, 
		"魔防": 80, 
		"暴击": 0, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 8, 
		"视野": 300, 
		"攻击范围": 45, 
		"攻击欲望": 70, 
		"回血": 0, 
		"经验": 1, 
		"金币": 1, 
		"掉落概率": 1, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 10, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_1", 
		"显示名": "小猴子"
	}, 
	"yh": {
		"名字": "妖猴", 
		"等级": 5, 
		"生命": 90, 
		"攻击间隔": 60, 
		"物防": 50, 
		"魔防": 80, 
		"暴击": 0, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 11, 
		"视野": 300, 
		"攻击范围": 85, 
		"攻击欲望": 90, 
		"回血": 0, 
		"经验": 5, 
		"金币": 2, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 20, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_2", 
		"显示名": "妖猴"
	}, 
	"dxx": {
		"名字": "大猩猩", 
		"等级": 5, 
		"生命": 300, 
		"攻击间隔": 30, 
		"物防": 50, 
		"魔防": 80, 
		"暴击": 5, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 12, 
		"视野": 400, 
		"攻击范围": 135, 
		"攻击欲望": 100, 
		"回血": 0, 
		"经验": 35, 
		"金币": 10, 
		"掉落概率": 1, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 65, 
				"kind": "physics"
			}, 
			{
				"name": "hit1", 
				"power": 30, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_3", 
		"显示名": "大猩猩"
	}, 
	"mhw": {
		"名字": "猕猴王", 
		"等级": 10, 
		"生命": 600, 
		"攻击间隔": 120, 
		"物防": 50, 
		"魔防": 80, 
		"暴击": 5, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 9, 
		"视野": 500, 
		"攻击范围": 115, 
		"攻击欲望": 90, 
		"回血": 0, 
		"经验": 50, 
		"金币": 20, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 55, 
				"kind": "physics"
			}, 
			{
				"name": "tfhx", 
				"power": 90, 
				"kind": "magic"
			}, 
			{
				"name": "jfkx", 
				"power": 80, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_4", 
		"显示名": "猕猴王"
	}, 
	"lw": {
		"名字": "龙王", 
		"等级": 27, 
		"生命": 15000, 
		"攻击间隔": 15, 
		"物防": 110, 
		"魔防": 160, 
		"暴击": 5, 
		"闪避": 0, 
		"幸运": 15, 
		"命中": 10, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 11, 
		"视野": 600, 
		"攻击范围": 160, 
		"攻击欲望": 100, 
		"回血": 0, 
		"经验": 200, 
		"金币": 200, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 180, 
				"kind": "physics"
			}, 
			{
				"name": "qnbx", 
				"power": 150, 
				"kind": "real"
			}, 
			{
				"name": "qnhb", 
				"power": 120, 
				"kind": "real"
			}, 
			{
				"name": "htsl", 
				"power": 100, 
				"kind": "real"
			}
		], 
		"脚本": "Monster_6", 
		"显示名": "龙王"
	}, 
	"yrw": {
		"名字": "禺狨王", 
		"等级": 13, 
		"生命": 1200, 
		"攻击间隔": 120, 
		"物防": 50, 
		"魔防": 80, 
		"暴击": 0, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 11, 
		"视野": 400, 
		"攻击范围": 180, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 80, 
		"金币": 30, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 55, 
				"kind": "physics"
			}, 
			{
				"name": "yyzl", 
				"power": 75, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_5", 
		"显示名": "禺狨王"
	}, 
	"bf": {
		"名字": "蝙蝠", 
		"等级": 17, 
		"生命": 370, 
		"攻击间隔": 60, 
		"物防": 60, 
		"魔防": 70, 
		"暴击": 8, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 8, 
		"视野": 300, 
		"攻击范围": 75, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 15, 
		"金币": 4, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 25, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_7", 
		"显示名": "蝙蝠"
	}, 
	"bfsx": {
		"名字": "蝙蝠石像", 
		"等级": 17, 
		"生命": 2500, 
		"攻击间隔": 10, 
		"物防": 500, 
		"魔防": 500, 
		"暴击": 0, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 200, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 500, 
		"速度": 0, 
		"视野": 300, 
		"攻击范围": 75, 
		"攻击欲望": 100, 
		"回血": 50, 
		"经验": 50, 
		"金币": 14, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 0, 
				"kind": ""
			}
		], 
		"脚本": "Monster_8", 
		"显示名": "蝙蝠石像"
	}, 
	"ys": {
		"名字": "妖狮", 
		"等级": 18, 
		"生命": 500, 
		"攻击间隔": 15, 
		"物防": 60, 
		"魔防": 70, 
		"暴击": 8, 
		"闪避": 4, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 7, 
		"视野": 400, 
		"攻击范围": 70, 
		"攻击欲望": 60, 
		"回血": 0, 
		"经验": 20, 
		"金币": 4, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 30, 
				"kind": "physics"
			}, 
			{
				"name": "dmfd", 
				"power": 40, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_10", 
		"显示名": "妖狮"
	}, 
	"dsj": {
		"名字": "地鼠精", 
		"等级": 18, 
		"生命": 450, 
		"攻击间隔": 10, 
		"物防": 60, 
		"魔防": 70, 
		"暴击": 8, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 7, 
		"视野": 300, 
		"攻击范围": 75, 
		"攻击欲望": 50, 
		"回血": 0, 
		"经验": 20, 
		"金币": 4, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 35, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_9", 
		"显示名": "地鼠精"
	}, 
	"stw": {
		"名字": "狮驼王", 
		"等级": 18, 
		"生命": 3500, 
		"攻击间隔": 30, 
		"物防": 60, 
		"魔防": 70, 
		"暴击": 10, 
		"闪避": 6, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 12, 
		"视野": 300, 
		"攻击范围": 85, 
		"攻击欲望": 85, 
		"回血": 0, 
		"经验": 100, 
		"金币": 30, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 135, 
				"kind": "physics"
			}, 
			{
				"name": "kldw", 
				"power": 5, 
				"kind": "real"
			}, 
			{
				"name": "ysyb", 
				"power": 330, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_11", 
		"显示名": "狮驼王"
	}, 
	"jjy": {
		"名字": "机甲鹰", 
		"等级": 18, 
		"生命": 500, 
		"攻击间隔": 10, 
		"物防": 60, 
		"魔防": 60, 
		"暴击": 10, 
		"闪避": 5, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 8, 
		"视野": 300, 
		"攻击范围": 75, 
		"攻击欲望": 40, 
		"回血": 0, 
		"经验": 20, 
		"金币": 4, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 45, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_13", 
		"显示名": "机甲鹰"
	}, 
	"pmw": {
		"名字": "鹏魔王", 
		"等级": 20, 
		"生命": 4500, 
		"攻击间隔": 120, 
		"物防": 80, 
		"魔防": 80, 
		"暴击": 10, 
		"闪避": 5, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 10, 
		"视野": 300, 
		"攻击范围": 85, 
		"攻击欲望": 60, 
		"回血": 0, 
		"经验": 100, 
		"金币": 30, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 70, 
				"kind": "real"
			}, 
			{
				"name": "bshn", 
				"power": 110, 
				"kind": "real"
			}, 
			{
				"name": "hydd", 
				"power": 35, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_12", 
		"显示名": "鹏魔王"
	}, 
	"xb": {
		"名字": "虾兵", 
		"等级": 20, 
		"生命": 500, 
		"攻击间隔": 10, 
		"物防": 80, 
		"魔防": 120, 
		"暴击": 5, 
		"闪避": 5, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 11, 
		"视野": 300, 
		"攻击范围": 600, 
		"攻击欲望": 40, 
		"回血": 0, 
		"经验": 35, 
		"金币": 10, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 30, 
				"kind": "physics"
			}, 
			{
				"name": "slz", 
				"power": 90, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_14", 
		"显示名": "虾兵"
	}, 
	"xj": {
		"名字": "蟹将", 
		"等级": 20, 
		"生命": 600, 
		"攻击间隔": 15, 
		"物防": 80, 
		"魔防": 120, 
		"暴击": 5, 
		"闪避": 5, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 6, 
		"视野": 400, 
		"攻击范围": 80, 
		"攻击欲望": 60, 
		"回血": 0, 
		"经验": 35, 
		"金币": 10, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 30, 
				"kind": "physics"
			}, 
			{
				"name": "qlzg", 
				"power": 40, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_15", 
		"显示名": "蟹将"
	}, 
	"gcx": {
		"名字": "龟丞相", 
		"等级": 20, 
		"生命": 5000, 
		"攻击间隔": 30, 
		"物防": 90, 
		"魔防": 120, 
		"暴击": 10, 
		"闪避": 5, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 9, 
		"视野": 400, 
		"攻击范围": 400, 
		"攻击欲望": 75, 
		"回血": 0, 
		"经验": 350, 
		"金币": 200, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 155, 
				"kind": "real"
			}, 
			{
				"name": "xfj", 
				"power": 185, 
				"kind": "magic"
			}, 
			{
				"name": "hit1", 
				"power": 100, 
				"kind": "real"
			}, 
			{
				"name": "xfj", 
				"power": 35, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_17", 
		"显示名": "龟丞相"
	}, 
	"yjj": {
		"名字": "鱼将军", 
		"等级": 20, 
		"生命": 700, 
		"攻击间隔": 20, 
		"物防": 80, 
		"魔防": 120, 
		"暴击": 5, 
		"闪避": 5, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 8, 
		"视野": 300, 
		"攻击范围": 225, 
		"攻击欲望": 60, 
		"回血": 0, 
		"经验": 50, 
		"金币": 13, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 30, 
				"kind": "physics"
			}, 
			{
				"name": "xzfc", 
				"power": 40, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_16", 
		"显示名": "鱼将军"
	}, 
	"jmw": {
		"名字": "蛟魔王", 
		"等级": 23, 
		"生命": 7000, 
		"攻击间隔": 30, 
		"物防": 100, 
		"魔防": 150, 
		"暴击": 15, 
		"闪避": 5, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 10, 
		"视野": 300, 
		"攻击范围": 95, 
		"攻击欲望": 90, 
		"回血": 0, 
		"经验": 200, 
		"金币": 200, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 165, 
				"kind": "physics"
			}, 
			{
				"name": "fhjl", 
				"power": 228, 
				"kind": "real"
			}, 
			{
				"name": "dtsz", 
				"power": 200, 
				"kind": "real"
			}
		], 
		"脚本": "Monster_18", 
		"显示名": "蛟魔王"
	}, 
	"smw": {
		"名字": "鲨魔王", 
		"等级": 25, 
		"生命": 10000, 
		"攻击间隔": 60, 
		"物防": 100, 
		"魔防": 150, 
		"暴击": 15, 
		"闪避": 5, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 8, 
		"视野": 450, 
		"攻击范围": 145, 
		"攻击欲望": 100, 
		"回血": 0, 
		"经验": 200, 
		"金币": 200, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 225, 
				"kind": "physics"
			}, 
			{
				"name": "sxks", 
				"power": 245, 
				"kind": "magic"
			}, 
			{
				"name": "sxks_2", 
				"power": 155, 
				"kind": "real"
			}, 
			{
				"name": "spzd", 
				"power": 400, 
				"kind": "real"
			}
		], 
		"脚本": "Monster_20", 
		"显示名": "鲨魔王"
	}, 
	"sy": {
		"名字": "千里眼", 
		"等级": 35, 
		"生命": 40000, 
		"攻击间隔": 15, 
		"物防": 180, 
		"魔防": 180, 
		"暴击": 0, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 20, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 14, 
		"视野": 400, 
		"攻击范围": 350, 
		"攻击欲望": 75, 
		"回血": 0, 
		"经验": 0, 
		"金币": 100, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 330, 
				"kind": "physics"
			}, 
			{
				"name": "hit2", 
				"power": 600, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 700, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_77", 
		"显示名": "嗜血狂鲨"
	}, 
	"nmds": {
		"名字": "牛魔斗士", 
		"等级": 25, 
		"生命": 1200, 
		"攻击间隔": 30, 
		"物防": 100, 
		"魔防": 160, 
		"暴击": 50, 
		"闪避": 5, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 10, 
		"视野": 500, 
		"攻击范围": 100, 
		"攻击欲望": 70, 
		"回血": 0, 
		"经验": 50, 
		"金币": 20, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 150, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_21", 
		"显示名": "牛魔斗士"
	}, 
	"nmw1": {
		"名字": "牛魔王·兽", 
		"等级": 50, 
		"生命": 250000, 
		"攻击间隔": 0, 
		"物防": 300, 
		"魔防": 350, 
		"暴击": 105, 
		"闪避": 40, 
		"幸运": 100, 
		"命中": 200, 
		"魔抗": 0, 
		"物穿": 100, 
		"魔穿": 100, 
		"暴击减免": 0, 
		"速度": 40, 
		"视野": 300, 
		"攻击范围": 85, 
		"攻击欲望": 70, 
		"回血": 0, 
		"经验": 0, 
		"金币": 1, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 1000, 
				"kind": "physics"
			}, 
			{
				"name": "Fire", 
				"power": 1000, 
				"kind": "magic"
			}, 
			{
				"name": "hit1", 
				"power": 300, 
				"kind": "physics"
			}, 
			{
				"name": "Fire", 
				"power": 300, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_22", 
		"显示名": "牛魔王一"
	}, 
	"nmw2": {
		"名字": "牛魔王·人", 
		"等级": 50, 
		"生命": 350000, 
		"攻击间隔": 15, 
		"物防": 335, 
		"魔防": 350, 
		"暴击": 30, 
		"闪避": 25, 
		"幸运": 60, 
		"命中": 20, 
		"魔抗": 10, 
		"物穿": 40, 
		"魔穿": 40, 
		"暴击减免": 0, 
		"速度": 10, 
		"视野": 400, 
		"攻击范围": 170, 
		"攻击欲望": 90, 
		"回血": 0, 
		"经验": 0, 
		"金币": 200, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": "int(250 * up_power)", 
				"kind": "physics"
			}, 
			{
				"name": "whs", 
				"power": "int(500 * up_power)", 
				"kind": "magic"
			}, 
			{
				"name": "ryzj", 
				"power": "int(500 * up_power)", 
				"kind": "magic"
			}, 
			{
				"name": "mncz", 
				"power": "int(1500 * up_power)", 
				"kind": "magic"
			}, 
			{
				"name": "hit1", 
				"power": "int(150 * up_power)", 
				"kind": "physics"
			}, 
			{
				"name": "whs", 
				"power": "int(200 * up_power)", 
				"kind": "magic"
			}, 
			{
				"name": "ryzj", 
				"power": "int(100 * up_power)", 
				"kind": "magic"
			}, 
			{
				"name": "mncz", 
				"power": "int(300 * up_power)", 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_23", 
		"显示名": "牛魔王二"
	}, 
	"nmw3": {
		"名字": "牛魔王·鬼", 
		"等级": 50, 
		"生命": 400000, 
		"攻击间隔": 0, 
		"物防": 500, 
		"魔防": 500, 
		"暴击": 40, 
		"闪避": 35, 
		"幸运": 60, 
		"命中": 20, 
		"魔抗": 0, 
		"物穿": 50, 
		"魔穿": 50, 
		"暴击减免": 0, 
		"速度": 40, 
		"视野": 300, 
		"攻击范围": 85, 
		"攻击欲望": 70, 
		"回血": 0, 
		"经验": 0, 
		"金币": 200, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 450, 
				"kind": "physics"
			}, 
			{
				"name": "Fire", 
				"power": 850, 
				"kind": "magic"
			}, 
			{
				"name": "hit1", 
				"power": 450, 
				"kind": "physics"
			}, 
			{
				"name": "Fire", 
				"power": 250, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_24", 
		"显示名": "牛魔王三"
	}, 
	"hhe": {
		"名字": "魔·红孩儿", 
		"等级": "RoleProp.baseroleprop.Level + 2", 
		"生命": "5000 + RoleProp.roleprop.SHp * 10", 
		"攻击间隔": 10, 
		"物防": 165, 
		"魔防": 165, 
		"暴击": 10, 
		"闪避": 5, 
		"幸运": 15, 
		"命中": 15, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 13, 
		"视野": 300, 
		"攻击范围": 165, 
		"攻击欲望": 90, 
		"回血": 0, 
		"经验": 100, 
		"金币": 100, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": "int(40 + RoleProp.roleprop.power * 0.2)", 
				"kind": "physics"
			}, 
			{
				"name": "lxhjq", 
				"power": "int(50 + RoleProp.roleprop.power * 0.6)", 
				"kind": "magic"
			}, 
			{
				"name": "tghs", 
				"power": "int(60 + RoleProp.roleprop.power * 0.4)", 
				"kind": "magic"
			}, 
			{
				"name": "smzh", 
				"power": "int(20 + RoleProp.roleprop.power * 0.12)", 
				"kind": "real"
			}
		], 
		"脚本": "Monster_29", 
		"显示名": "红孩儿"
	}, 
	"gd": {
		"名字": "鬼灯", 
		"等级": 25, 
		"生命": 1300, 
		"攻击间隔": 10, 
		"物防": 120, 
		"魔防": 120, 
		"暴击": 20, 
		"闪避": 15, 
		"幸运": 0, 
		"命中": 10, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 13, 
		"视野": 300, 
		"攻击范围": 45, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 60, 
		"金币": 22, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 175, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_26", 
		"显示名": "鬼灯"
	}, 
	"js": {
		"名字": "僵尸", 
		"等级": 25, 
		"生命": 1600, 
		"攻击间隔": 10, 
		"物防": 120, 
		"魔防": 120, 
		"暴击": 20, 
		"闪避": 10, 
		"幸运": 0, 
		"命中": 10, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 10, 
		"视野": 300, 
		"攻击范围": 45, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 60, 
		"金币": 22, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 255, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_27", 
		"显示名": "僵尸"
	}, 
	"syr": {
		"名字": "守夜人", 
		"等级": 25, 
		"生命": 15000, 
		"攻击间隔": 30, 
		"物防": 120, 
		"魔防": 150, 
		"暴击": 35, 
		"闪避": 18, 
		"幸运": 0, 
		"命中": 10, 
		"魔抗": 10, 
		"物穿": 20, 
		"魔穿": 20, 
		"暴击减免": 0, 
		"速度": 6, 
		"视野": 400, 
		"攻击范围": 135, 
		"攻击欲望": 100, 
		"回血": 0, 
		"经验": 200, 
		"金币": 200, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 180, 
				"kind": "physics"
			}, 
			{
				"name": "hsg", 
				"power": "90 + RoleProp.roleprop.SHp * 0.08", 
				"kind": "physics"
			}, 
			{
				"name": "hit1", 
				"power": 90, 
				"kind": "physics"
			}, 
			{
				"name": "hsg", 
				"power": "40 + RoleProp.roleprop.SHp * 0.04", 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_28", 
		"显示名": "守夜人"
	}, 
	"bgj": {
		"名字": "白骨精·精", 
		"等级": 30, 
		"生命": 20000, 
		"攻击间隔": 120, 
		"物防": 150, 
		"魔防": 150, 
		"暴击": 0, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 30, 
		"魔穿": 30, 
		"暴击减免": 0, 
		"速度": 9, 
		"视野": 300, 
		"攻击范围": 85, 
		"攻击欲望": 50, 
		"回血": 0, 
		"经验": 0, 
		"金币": 0, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 350, 
				"kind": "physics"
			}, 
			{
				"name": "dmzw", 
				"power": 0, 
				"kind": "magic"
			}, 
			{
				"name": "dmlhc", 
				"power": 280, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_32", 
		"显示名": "白骨精"
	}, 
	"hwc": {
		"名字": "黑无常", 
		"等级": 27, 
		"生命": 20000, 
		"攻击间隔": 0, 
		"物防": 150, 
		"魔防": 150, 
		"暴击": 15, 
		"闪避": 10, 
		"幸运": 0, 
		"命中": 10, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 8, 
		"视野": 300, 
		"攻击范围": 245, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 360, 
		"金币": 200, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 338, 
				"kind": "physics"
			}, 
			{
				"name": "hit1", 
				"power": 288, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_30", 
		"显示名": "黑无常"
	}, 
	"bwc": {
		"名字": "白无常", 
		"等级": 27, 
		"生命": 15000, 
		"攻击间隔": 0, 
		"物防": 150, 
		"魔防": 150, 
		"暴击": 15, 
		"闪避": 10, 
		"幸运": 0, 
		"命中": 10, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 8, 
		"视野": 300, 
		"攻击范围": 305, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 360, 
		"金币": 200, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 368, 
				"kind": "physics"
			}, 
			{
				"name": "hit1", 
				"power": 248, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_31", 
		"显示名": "白无常"
	}, 
	"kl": {
		"名字": "傀儡", 
		"等级": 999, 
		"生命": 999999999, 
		"攻击间隔": 120, 
		"物防": 150, 
		"魔防": 150, 
		"暴击": 8, 
		"闪避": 10, 
		"幸运": 20, 
		"命中": 20, 
		"魔抗": 20, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 9, 
		"视野": 400, 
		"攻击范围": 260, 
		"攻击欲望": 60, 
		"回血": 0, 
		"经验": 0, 
		"金币": 0, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 240, 
				"kind": "real"
			}
		], 
		"脚本": "Monster_34", 
		"显示名": "傀儡"
	}, 
	"klw": {
		"名字": "傀儡王", 
		"等级": 27, 
		"生命": 25000, 
		"攻击间隔": 0, 
		"物防": 150, 
		"魔防": 150, 
		"暴击": 0, 
		"闪避": 8, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 40, 
		"视野": 300, 
		"攻击范围": 85, 
		"攻击欲望": 70, 
		"回血": 0, 
		"经验": 0, 
		"金币": 500, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 0, 
				"kind": "physics"
			}, 
			{
				"name": "KLZD", 
				"power": 400, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_33", 
		"显示名": "傀儡王"
	}, 
	"qgw": {
		"名字": "秦广王", 
		"等级": 27, 
		"生命": 20000, 
		"攻击间隔": 15, 
		"物防": 150, 
		"魔防": 155, 
		"暴击": 20, 
		"闪避": 15, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 9, 
		"视野": 500, 
		"攻击范围": 325, 
		"攻击欲望": 60, 
		"回血": 0, 
		"经验": 200, 
		"金币": 200, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 120, 
				"kind": "magic"
			}, 
			{
				"name": "wdzh", 
				"power": 30, 
				"kind": "magic"
			}, 
			{
				"name": "Dead", 
				"power": 30, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_37", 
		"显示名": "秦广王"
	}, 
	"pg": {
		"名字": "判官", 
		"等级": 27, 
		"生命": 20000, 
		"攻击间隔": 15, 
		"物防": 120, 
		"魔防": 120, 
		"暴击": 0, 
		"闪避": 25, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 8, 
		"视野": 600, 
		"攻击范围": 800, 
		"攻击欲望": 60, 
		"回血": 0, 
		"经验": 200, 
		"金币": 200, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 270, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_41", 
		"显示名": "判官"
	}, 
	"ylw": {
		"名字": "阎罗王", 
		"等级": 27, 
		"生命": 28000, 
		"攻击间隔": 20, 
		"物防": 150, 
		"魔防": 150, 
		"暴击": 15, 
		"闪避": 10, 
		"幸运": 40, 
		"命中": 6, 
		"魔抗": 8, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 5, 
		"速度": 8, 
		"视野": 400, 
		"攻击范围": 105, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 50, 
		"金币": 13, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 220, 
				"kind": "physics"
			}, 
			{
				"name": "gwjq", 
				"power": 170, 
				"kind": "magic"
			}, 
			{
				"name": "csjq", 
				"power": "int(RoleProp.roleprop.SHp * 0.3)", 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_43", 
		"显示名": "阎罗王"
	}, 
	"sdgm": {
		"名字": "傀儡", 
		"等级": 999, 
		"生命": 999999999, 
		"攻击间隔": 120, 
		"物防": 150, 
		"魔防": 150, 
		"暴击": 8, 
		"闪避": 10, 
		"幸运": 20, 
		"命中": 20, 
		"魔抗": 20, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 9, 
		"视野": 400, 
		"攻击范围": 260, 
		"攻击欲望": 60, 
		"回血": 0, 
		"经验": 0, 
		"金币": 0, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 240, 
				"kind": "real"
			}
		], 
		"脚本": "Monster_34", 
		"显示名": "三道鬼门"
	}, 
	"sdw": {
		"名字": "宋帝王", 
		"等级": 30, 
		"生命": "19000 + BeHitCount * 8000", 
		"攻击间隔": 10, 
		"物防": "125 + BeHitCount * 15", 
		"魔防": "95 + BeHitCount * 15", 
		"暴击": "5 + BeHitCount * 0.2", 
		"闪避": "5 + BeHitCount * 0.8", 
		"幸运": "5 + BeHitCount * 0.5", 
		"命中": "5 + BeHitCount * 0.5", 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 10, 
		"视野": 400, 
		"攻击范围": 185, 
		"攻击欲望": "50 + BeHitCount * 1.5", 
		"回血": "BeHitCount * 70", 
		"经验": 100, 
		"金币": 100, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": "128 + BeHitCount * 25", 
				"kind": "physics"
			}, 
			{
				"name": "zmhy", 
				"power": "128 + BeHitCount * 25", 
				"kind": "magic"
			}, 
			{
				"name": "zzzy", 
				"power": "333 + BeHitCount * 20", 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_59", 
		"显示名": "宋帝王"
	}, 
	"yc": {
		"名字": "夜叉", 
		"等级": 30, 
		"生命": 35000, 
		"攻击间隔": 0, 
		"物防": 150, 
		"魔防": 150, 
		"暴击": 25, 
		"闪避": 10, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": -10, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 8, 
		"视野": 400, 
		"攻击范围": 158, 
		"攻击欲望": 85, 
		"回血": 0, 
		"经验": 0, 
		"金币": 0, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": "int(100 + RoleProp.roleprop.SHp * 0.02)", 
				"kind": "real"
			}, 
			{
				"name": "fszy", 
				"power": "int(300 + RoleProp.roleprop.SHp * 0.02)", 
				"kind": "real"
			}
		], 
		"脚本": "Monster_48", 
		"显示名": "夜叉"
	}, 
	"mp": {
		"名字": "孟婆", 
		"等级": 30, 
		"生命": 30000, 
		"攻击间隔": 20, 
		"物防": 125, 
		"魔防": 125, 
		"暴击": 0, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 5, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 7, 
		"视野": 400, 
		"攻击范围": 225, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 50, 
		"金币": 13, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 240, 
				"kind": "magic"
			}, 
			{
				"name": "mffd_1", 
				"power": "int(RoleProp.roleprop.SHp * 0.03 + 200)", 
				"kind": "magic"
			}, 
			{
				"name": "mffd_2", 
				"power": "int(RoleProp.roleprop.SHp * 0.03 + 200)", 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_49", 
		"显示名": "孟婆"
	}, 
	"xt": {
		"名字": "刑天", 
		"等级": 30, 
		"生命": 33000, 
		"攻击间隔": 15, 
		"物防": 150, 
		"魔防": 120, 
		"暴击": 22, 
		"闪避": 15, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 10, 
		"视野": 500, 
		"攻击范围": 245, 
		"攻击欲望": 60, 
		"回血": 0, 
		"经验": 200, 
		"金币": 200, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 338, 
				"kind": "magic"
			}, 
			{
				"name": "mykl", 
				"power": 338, 
				"kind": "magic"
			}, 
			{
				"name": "xmhd", 
				"power": 0, 
				"kind": "magic"
			}, 
			{
				"name": "sfjm", 
				"power": 688, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_60", 
		"显示名": "刑天"
	}, 
	"zsxt": {
		"名字": "战神刑天", 
		"等级": "RoleProp.baseroleprop.Level + 4", 
		"生命": "500000 + RoleProp.roleprop.SHp * 75", 
		"攻击间隔": 0, 
		"物防": "RoleProp.roleprop.Def", 
		"魔防": "RoleProp.roleprop.Mdef", 
		"暴击": "RoleProp.roleprop.Crit", 
		"闪避": "RoleProp.roleprop.Miss", 
		"幸运": "RoleProp.roleprop.Lucky", 
		"命中": "RoleProp.roleprop.Htarget * 2", 
		"魔抗": 0, 
		"物穿": "RoleProp.roleprop.ar", 
		"魔穿": "RoleProp.roleprop.sp", 
		"暴击减免": 0, 
		"速度": 13, 
		"视野": 550, 
		"攻击范围": 225, 
		"攻击欲望": 90, 
		"回血": "self.SHp * 0.002", 
		"经验": 5000, 
		"金币": 5000, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": "int(800 + RoleProp.roleprop.power)", 
				"kind": "physics"
			}, 
			{
				"name": "mykl", 
				"power": "int(350 + RoleProp.roleprop.power * 0.35)", 
				"kind": "magic"
			}, 
			{
				"name": "xmhd", 
				"power": 0, 
				"kind": "magic"
			}, 
			{
				"name": "sfjm", 
				"power": "int(800 + RoleProp.roleprop.power * 0.3)", 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_42", 
		"显示名": "战神刑天"
	}, 
	"zlw1": {
		"名字": "转轮·圣帝", 
		"等级": 50, 
		"生命": 300000, 
		"攻击间隔": 10, 
		"物防": 350, 
		"魔防": 350, 
		"暴击": 20, 
		"闪避": 15, 
		"幸运": 15, 
		"命中": 15, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 80, 
		"暴击减免": 0, 
		"速度": 6, 
		"视野": 400, 
		"攻击范围": 185, 
		"攻击欲望": 90, 
		"回血": 0, 
		"经验": 0, 
		"金币": 10, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "wqml", 
				"power": 700, 
				"kind": "magic"
			}, 
			{
				"name": "zlls", 
				"power": 900, 
				"kind": "magic"
			}, 
			{
				"name": "dylh", 
				"power": 2000, 
				"kind": "magic"
			}, 
			{
				"name": "dyml", 
				"power": 2077, 
				"kind": "magic"
			}, 
			{
				"name": "wqml", 
				"power": 205, 
				"kind": "magic"
			}, 
			{
				"name": "zlls", 
				"power": 200, 
				"kind": "magic"
			}, 
			{
				"name": "dylh", 
				"power": 600, 
				"kind": "magic"
			}, 
			{
				"name": "dyml", 
				"power": 577, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_55", 
		"显示名": "转轮王一"
	}, 
	"zlw2": {
		"名字": "转轮·真法", 
		"等级": 50, 
		"生命": 350000, 
		"攻击间隔": 0, 
		"物防": 400, 
		"魔防": 400, 
		"暴击": 25, 
		"闪避": 35, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 6, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 12, 
		"速度": 0, 
		"视野": 0, 
		"攻击范围": 0, 
		"攻击欲望": 0, 
		"回血": 1000, 
		"经验": 0, 
		"金币": 0, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": "200 * poweradd", 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": "200 * poweradd", 
				"kind": "magic"
			}, 
			{
				"name": "hit1", 
				"power": "200 * poweradd", 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": "200 * poweradd", 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_56", 
		"显示名": "转轮王二"
	}, 
	"zlw3": {
		"名字": "转轮·圣王", 
		"等级": 50, 
		"生命": 250000, 
		"攻击间隔": 120, 
		"物防": 350, 
		"魔防": 380, 
		"暴击": 25, 
		"闪避": 8, 
		"幸运": 15, 
		"命中": 15, 
		"魔抗": 0, 
		"物穿": 30, 
		"魔穿": 70, 
		"暴击减免": 0, 
		"速度": 10, 
		"视野": 300, 
		"攻击范围": 600, 
		"攻击欲望": 90, 
		"回血": 0, 
		"经验": 1000, 
		"金币": 1000, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 600, 
				"kind": "magic"
			}, 
			{
				"name": "hit1_1", 
				"power": 660, 
				"kind": "magic"
			}, 
			{
				"name": "hit1_2", 
				"power": 680, 
				"kind": "magic"
			}, 
			{
				"name": "hit1_3", 
				"power": 520, 
				"kind": "magic"
			}, 
			{
				"name": "dmzhl", 
				"power": 600, 
				"kind": "magic"
			}, 
			{
				"name": "dmgz", 
				"power": 800, 
				"kind": "magic"
			}, 
			{
				"name": "hit1", 
				"power": 200, 
				"kind": "magic"
			}, 
			{
				"name": "hit1_1", 
				"power": 220, 
				"kind": "magic"
			}, 
			{
				"name": "hit1_2", 
				"power": 240, 
				"kind": "magic"
			}, 
			{
				"name": "hit1_3", 
				"power": 260, 
				"kind": "magic"
			}, 
			{
				"name": "dmzhl", 
				"power": 300, 
				"kind": "magic"
			}, 
			{
				"name": "dmgz", 
				"power": 400, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_57", 
		"显示名": "转轮王三"
	}, 
	"wgw": {
		"名字": "五毒·五官王", 
		"等级": "RoleProp.baseroleprop.Level", 
		"生命": "160000 + int(RoleProp.baseroleprop.Level * 10000)", 
		"攻击间隔": 90, 
		"物防": "130 + int(RoleProp.baseroleprop.Level * 3)", 
		"魔防": "130 + int(RoleProp.baseroleprop.Level * 3)", 
		"暴击": "5 + int(RoleProp.baseroleprop.Level * 0.7)", 
		"闪避": "5 + int(RoleProp.baseroleprop.Level * 0.3)", 
		"幸运": "0 + int(RoleProp.baseroleprop.Level * 1.5)", 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": "20 + int(RoleProp.baseroleprop.Level * 0.6)", 
		"魔穿": "20 + int(RoleProp.baseroleprop.Level * 0.6)", 
		"暴击减免": 0, 
		"速度": 12, 
		"视野": 500, 
		"攻击范围": 300, 
		"攻击欲望": 60, 
		"回血": 0, 
		"经验": 200, 
		"金币": 200, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": "300 + int(RoleProp.baseroleprop.Level * 9)", 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": "500 + int(RoleProp.baseroleprop.Level * 13)", 
				"kind": "real"
			}, 
			{
				"name": "hit3", 
				"power": 0, 
				"kind": "magic"
			}, 
			{
				"name": "hit4", 
				"power": "400 + int(RoleProp.baseroleprop.Level * 11)", 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_61", 
		"显示名": "五官王"
	}, 
	"bcw": {
		"名字": "五毒·卞城王", 
		"等级": "RoleProp.baseroleprop.Level", 
		"生命": "180000 + int(RoleProp.baseroleprop.Level * 12000)", 
		"攻击间隔": 0, 
		"物防": "150 + int(RoleProp.baseroleprop.Level * 3)", 
		"魔防": "150 + int(RoleProp.baseroleprop.Level * 3)", 
		"暴击": "5 + int(RoleProp.baseroleprop.Level * 0.8)", 
		"闪避": "5 + int(RoleProp.baseroleprop.Level * 0.4)", 
		"幸运": "0 + int(RoleProp.baseroleprop.Level * 1.5)", 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": "20 + int(RoleProp.baseroleprop.Level * 0.6)", 
		"魔穿": "20 + int(RoleProp.baseroleprop.Level * 0.6)", 
		"暴击减免": 0, 
		"速度": 11, 
		"视野": 0, 
		"攻击范围": 280, 
		"攻击欲望": 0, 
		"回血": 0, 
		"经验": 0, 
		"金币": 0, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": "300 + int(RoleProp.baseroleprop.Level * 8)", 
				"kind": "physics"
			}, 
			{
				"name": "hit2", 
				"power": "100 + int(RoleProp.baseroleprop.Level * 12)", 
				"kind": "magic"
			}, 
			{
				"name": "hit4", 
				"power": "100 + int(RoleProp.baseroleprop.Level * 10)", 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_63", 
		"显示名": "卞城王"
	}, 
	"tsw": {
		"名字": "五毒·泰山王", 
		"等级": "RoleProp.baseroleprop.Level + 1", 
		"生命": "200000 + int(RoleProp.baseroleprop.Level * 14000)", 
		"攻击间隔": 15, 
		"物防": "180 + int(RoleProp.baseroleprop.Level * 3.5)", 
		"魔防": "180 + int(RoleProp.baseroleprop.Level * 3.5)", 
		"暴击": "5 + int(RoleProp.baseroleprop.Level * 1)", 
		"闪避": "5 + int(RoleProp.baseroleprop.Level * 0.5)", 
		"幸运": "0 + int(RoleProp.baseroleprop.Level * 1.6)", 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": "20 + int(RoleProp.baseroleprop.Level * 0.8)", 
		"魔穿": "20 + int(RoleProp.baseroleprop.Level * 0.8)", 
		"暴击减免": 0, 
		"速度": 9, 
		"视野": 500, 
		"攻击范围": 335, 
		"攻击欲望": 60, 
		"回血": 0, 
		"经验": 200, 
		"金币": 200, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": "300 + int(RoleProp.baseroleprop.Level * 8.5)", 
				"kind": "physics"
			}, 
			{
				"name": "hit1_1", 
				"power": "200 + int(RoleProp.baseroleprop.Level * 8)", 
				"kind": "magic"
			}, 
			{
				"name": "hit1_2", 
				"power": "300 + int(RoleProp.baseroleprop.Level * 8.5)", 
				"kind": "magic"
			}, 
			{
				"name": "xlyj", 
				"power": "400 + int(RoleProp.baseroleprop.Level * 8.5)", 
				"kind": "physics"
			}, 
			{
				"name": "yscs", 
				"power": 0, 
				"kind": "magic"
			}, 
			{
				"name": "tsyd", 
				"power": "500 + int(RoleProp.baseroleprop.Level * 9)", 
				"kind": "physics"
			}, 
			{
				"name": "zhq_3", 
				"power": "400 + int(RoleProp.baseroleprop.Level * 8.5)", 
				"kind": "physics"
			}, 
			{
				"name": "sgq", 
				"power": "300 + int(RoleProp.baseroleprop.Level * 8.5)", 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_64", 
		"显示名": "泰山王"
	}, 
	"dsw": {
		"名字": "五毒·都市王", 
		"等级": "RoleProp.baseroleprop.Level + 1", 
		"生命": "220000 + int(RoleProp.baseroleprop.Level * 16000)", 
		"攻击间隔": 15, 
		"物防": "180 + int(RoleProp.baseroleprop.Level * 4.0)", 
		"魔防": "180 + int(RoleProp.baseroleprop.Level * 4.0)", 
		"暴击": "5 + int(RoleProp.baseroleprop.Level * 1.2)", 
		"闪避": "5 + int(RoleProp.baseroleprop.Level * 0.6)", 
		"幸运": "0 + int(RoleProp.baseroleprop.Level * 1.8)", 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": "20 + int(RoleProp.baseroleprop.Level * 1.0)", 
		"魔穿": "20 + int(RoleProp.baseroleprop.Level * 1.0)", 
		"暴击减免": 0, 
		"速度": 13, 
		"视野": 500, 
		"攻击范围": 250, 
		"攻击欲望": 60, 
		"回血": 0, 
		"经验": 200, 
		"金币": 200, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": "400 + int(RoleProp.baseroleprop.Level * 8.6)", 
				"kind": "physics"
			}, 
			{
				"name": "zhzz", 
				"power": 0, 
				"kind": "physics"
			}, 
			{
				"name": "hit2_1", 
				"power": "400 + int(RoleProp.baseroleprop.Level * 8.5)", 
				"kind": "physics"
			}, 
			{
				"name": "hit2_2", 
				"power": "600 + int(RoleProp.baseroleprop.Level * 8.7)", 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_65", 
		"显示名": "都市王"
	}, 
	"pdw": {
		"名字": "五毒·平等王", 
		"等级": "RoleProp.baseroleprop.Level + 1", 
		"生命": "240000 + int(RoleProp.baseroleprop.Level * 16000)", 
		"攻击间隔": 15, 
		"物防": "180 + int(RoleProp.baseroleprop.Level * 4.3)", 
		"魔防": "180 + int(RoleProp.baseroleprop.Level * 4.3)", 
		"暴击": "5 + int(RoleProp.baseroleprop.Level * 1.4)", 
		"闪避": "5 + int(RoleProp.baseroleprop.Level * 0.7)", 
		"幸运": "0 + int(RoleProp.baseroleprop.Level * 2.0)", 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": "20 + int(RoleProp.baseroleprop.Level * 1.3)", 
		"魔穿": "20 + int(RoleProp.baseroleprop.Level * 1.3)", 
		"暴击减免": 0, 
		"速度": 12, 
		"视野": 500, 
		"攻击范围": 125, 
		"攻击欲望": 150, 
		"回血": 0, 
		"经验": 200, 
		"金币": 200, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": "500 + int(RoleProp.baseroleprop.Level * 8.8)", 
				"kind": "magic"
			}, 
			{
				"name": "skill_1_1", 
				"power": "2000 + int(RoleProp.baseroleprop.Level * 8.8)", 
				"kind": "magic"
			}, 
			{
				"name": "skill_1_2", 
				"power": "600 + int(RoleProp.baseroleprop.Level * 8.8)", 
				"kind": "magic"
			}, 
			{
				"name": "skill_1_3", 
				"power": "500 + int(RoleProp.baseroleprop.Level * 8.8)", 
				"kind": "magic"
			}, 
			{
				"name": "skill_1_4", 
				"power": "500 + int(RoleProp.baseroleprop.Level * 8.8)", 
				"kind": "magic"
			}, 
			{
				"name": "skill_2", 
				"power": "1000 + int(RoleProp.baseroleprop.Level * 8.8)", 
				"kind": "real"
			}, 
			{
				"name": "skill_3", 
				"power": "400 + int(RoleProp.baseroleprop.Level * 8.8)", 
				"kind": "real"
			}, 
			{
				"name": "skill_4", 
				"power": "1000 + int(RoleProp.baseroleprop.Level * 8.8)", 
				"kind": "real"
			}
		], 
		"脚本": "Monster_6601", 
		"显示名": "平等王"
	}, 
	"nt": {
		"名字": "牛头", 
		"等级": 27, 
		"生命": 2000, 
		"攻击间隔": 10, 
		"物防": 150, 
		"魔防": 150, 
		"暴击": 15, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 8, 
		"视野": 300, 
		"攻击范围": 125, 
		"攻击欲望": 50, 
		"回血": 0, 
		"经验": 60, 
		"金币": 25, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 100, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_40", 
		"显示名": "牛头"
	}, 
	"mm": {
		"名字": "马面", 
		"等级": 27, 
		"生命": 2000, 
		"攻击间隔": 10, 
		"物防": 150, 
		"魔防": 150, 
		"暴击": 8, 
		"闪避": 6, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 8, 
		"视野": 300, 
		"攻击范围": 145, 
		"攻击欲望": 70, 
		"回血": 0, 
		"经验": 60, 
		"金币": 25, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 98, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_39", 
		"显示名": "马面"
	}, 
	"mz": {
		"名字": "曼珠", 
		"等级": 30, 
		"生命": 2500, 
		"攻击间隔": 0, 
		"物防": 180, 
		"魔防": 130, 
		"暴击": 8, 
		"闪避": 8, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": -20, 
		"物穿": 0, 
		"魔穿": 20, 
		"暴击减免": 10, 
		"速度": 7, 
		"视野": 400, 
		"攻击范围": 160, 
		"攻击欲望": 50, 
		"回血": 0, 
		"经验": 75, 
		"金币": 40, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 90, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_53", 
		"显示名": "曼珠"
	}, 
	"sh": {
		"名字": "沙华", 
		"等级": 30, 
		"生命": 3000, 
		"攻击间隔": 0, 
		"物防": 170, 
		"魔防": 130, 
		"暴击": 22, 
		"闪避": 10, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 20, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 7, 
		"视野": 400, 
		"攻击范围": 90, 
		"攻击欲望": 75, 
		"回血": 0, 
		"经验": 75, 
		"金币": 40, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 150, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_51", 
		"显示名": "沙华"
	}, 
	"qs": {
		"名字": "青蛇", 
		"等级": 30, 
		"生命": 3000, 
		"攻击间隔": 0, 
		"物防": 180, 
		"魔防": 130, 
		"暴击": 5, 
		"闪避": 19, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 20, 
		"暴击减免": 0, 
		"速度": 7, 
		"视野": 400, 
		"攻击范围": 260, 
		"攻击欲望": 75, 
		"回血": 0, 
		"经验": 75, 
		"金币": 40, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 150, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_54", 
		"显示名": "青蛇"
	}, 
	"ht": {
		"名字": "河童", 
		"等级": 30, 
		"生命": 2500, 
		"攻击间隔": 0, 
		"物防": 180, 
		"魔防": 130, 
		"暴击": 8, 
		"闪避": 8, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": -20, 
		"物穿": 20, 
		"魔穿": 0, 
		"暴击减免": 10, 
		"速度": 7, 
		"视野": 400, 
		"攻击范围": 120, 
		"攻击欲望": 90, 
		"回血": 0, 
		"经验": 75, 
		"金币": 40, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 130, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_52", 
		"显示名": "河童"
	}, 
	"zlsz": {
		"名字": "勾魂使者", 
		"等级": 30, 
		"生命": 5000, 
		"攻击间隔": 0, 
		"物防": 150, 
		"魔防": 100, 
		"暴击": 10, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 8, 
		"视野": 500, 
		"攻击范围": 80, 
		"攻击欲望": 60, 
		"回血": 0, 
		"经验": 90, 
		"金币": 50, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 180, 
				"kind": "physics"
			}, 
			{
				"name": "dmghr", 
				"power": 60, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_58", 
		"显示名": "转轮使者"
	}, 
	"gy": {
		"名字": "鱼", 
		"等级": "RoleProp.baseroleprop.Level", 
		"生命": 1, 
		"攻击间隔": 0, 
		"物防": 0, 
		"魔防": 0, 
		"暴击": 0, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 0, 
		"视野": 0, 
		"攻击范围": 0, 
		"攻击欲望": 0, 
		"回血": 0, 
		"经验": 0, 
		"金币": 0, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": "int(RoleProp.roleprop.SHp * 0.02) + 1", 
				"kind": "real"
			}, 
			{
				"name": "hit2", 
				"power": "int(RoleProp.roleprop.SHp * 0.02) + 1", 
				"kind": "real"
			}
		], 
		"脚本": "Monster_47", 
		"显示名": "鬼鱼"
	}, 
	"xtq": {
		"名字": "哮天犬", 
		"等级": 35, 
		"生命": 40000, 
		"攻击间隔": 0, 
		"物防": 150, 
		"魔防": 150, 
		"暴击": 20, 
		"闪避": 18, 
		"幸运": 18, 
		"命中": 10, 
		"魔抗": 10, 
		"物穿": 20, 
		"魔穿": 20, 
		"暴击减免": 0, 
		"速度": 12, 
		"视野": 400, 
		"攻击范围": 175, 
		"攻击欲望": 90, 
		"回血": 0, 
		"经验": 0, 
		"金币": 0, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 288, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 300, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 300, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_72", 
		"显示名": "哮天犬"
	}, 
	"ey": {
		"名字": "恶鹰", 
		"等级": 90, 
		"生命": 1, 
		"攻击间隔": 10, 
		"物防": 1, 
		"魔防": 1, 
		"暴击": 0, 
		"闪避": 1, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 15, 
		"视野": 600, 
		"攻击范围": 95, 
		"攻击欲望": 100, 
		"回血": 0, 
		"经验": 0, 
		"金币": 0, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": "1 + RoleProp.roleprop.SHp * 0.04", 
				"kind": "real"
			}
		], 
		"脚本": "Monster_73", 
		"显示名": "恶鹰"
	}, 
	"hg": {
		"名字": "黑龟", 
		"等级": 35, 
		"生命": 4000, 
		"攻击间隔": 15, 
		"物防": 150, 
		"魔防": 150, 
		"暴击": 10, 
		"闪避": 8, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 20, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 9, 
		"视野": 400, 
		"攻击范围": 200, 
		"攻击欲望": 90, 
		"回血": 0, 
		"经验": 110, 
		"金币": 70, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 200, 
				"kind": "physics"
			}, 
			{
				"name": "hit2", 
				"power": 150, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_74", 
		"显示名": "黑龟"
	}, 
	"hh": {
		"名字": "黑虎", 
		"等级": 35, 
		"生命": 4000, 
		"攻击间隔": 15, 
		"物防": 150, 
		"魔防": 150, 
		"暴击": 10, 
		"闪避": 8, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 20, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 14, 
		"视野": 400, 
		"攻击范围": 150, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 110, 
		"金币": 70, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 200, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_75", 
		"显示名": "黑虎"
	}, 
	"wy": {
		"名字": "巫鹰", 
		"等级": 35, 
		"生命": 5000, 
		"攻击间隔": 15, 
		"物防": 150, 
		"魔防": 150, 
		"暴击": 18, 
		"闪避": 8, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 20, 
		"物穿": 25, 
		"魔穿": 25, 
		"暴击减免": 0, 
		"速度": 11, 
		"视野": 400, 
		"攻击范围": 350, 
		"攻击欲望": 90, 
		"回血": 0, 
		"经验": 110, 
		"金币": 70, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 200, 
				"kind": "physics"
			}, 
			{
				"name": "hit2", 
				"power": 180, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_76", 
		"显示名": "巫鹰"
	}, 
	"qly": {
		"名字": "千里眼", 
		"等级": 35, 
		"生命": 40000, 
		"攻击间隔": 15, 
		"物防": 180, 
		"魔防": 180, 
		"暴击": 0, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 20, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 14, 
		"视野": 400, 
		"攻击范围": 350, 
		"攻击欲望": 75, 
		"回血": 0, 
		"经验": 0, 
		"金币": 100, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 330, 
				"kind": "physics"
			}, 
			{
				"name": "hit2", 
				"power": 600, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 700, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_77", 
		"显示名": "千里眼"
	}, 
	"sfe": {
		"名字": "顺风耳", 
		"等级": 35, 
		"生命": 40000, 
		"攻击间隔": 15, 
		"物防": 150, 
		"魔防": 150, 
		"暴击": 0, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 20, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 10, 
		"视野": 400, 
		"攻击范围": 350, 
		"攻击欲望": 75, 
		"回血": 0, 
		"经验": 0, 
		"金币": 100, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 500, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_78", 
		"显示名": "顺风耳"
	}, 
	"mhwtf": {
		"名字": "猕猴王·通风", 
		"等级": 35, 
		"生命": 60000, 
		"攻击间隔": 120, 
		"物防": 180, 
		"魔防": 180, 
		"暴击": 10, 
		"闪避": 18, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 30, 
		"魔穿": 30, 
		"暴击减免": 0, 
		"速度": 12, 
		"视野": 500, 
		"攻击范围": 145, 
		"攻击欲望": 90, 
		"回血": 0, 
		"经验": 0, 
		"金币": 200, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 505, 
				"kind": "physics"
			}, 
			{
				"name": "tfhx", 
				"power": 90, 
				"kind": "magic"
			}, 
			{
				"name": "jfkx", 
				"power": 450, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_96", 
		"显示名": "猕猴王·通风"
	}, 
	"jls": {
		"名字": "巨灵神", 
		"等级": 35, 
		"生命": 50000, 
		"攻击间隔": 15, 
		"物防": 150, 
		"魔防": 150, 
		"暴击": 0, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 20, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 15, 
		"视野": 400, 
		"攻击范围": 200, 
		"攻击欲望": 90, 
		"回血": 0, 
		"经验": 0, 
		"金币": 100, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 200, 
				"kind": "physics"
			}, 
			{
				"name": "hit2", 
				"power": 300, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 180, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_79", 
		"显示名": "巨灵神"
	}, 
	"tbd": {
		"名字": "天兵·刀", 
		"等级": 35, 
		"生命": 7000, 
		"攻击间隔": 10, 
		"物防": 160, 
		"魔防": 160, 
		"暴击": 0, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 18, 
		"魔抗": 0, 
		"物穿": 8, 
		"魔穿": 8, 
		"暴击减免": 0, 
		"速度": 11, 
		"视野": 500, 
		"攻击范围": 135, 
		"攻击欲望": 90, 
		"回血": 0, 
		"经验": 110, 
		"金币": 90, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 225, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_81", 
		"显示名": "天兵刀"
	}, 
	"tbq": {
		"名字": "天兵·枪", 
		"等级": 35, 
		"生命": 8000, 
		"攻击间隔": 10, 
		"物防": 160, 
		"魔防": 160, 
		"暴击": 0, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 18, 
		"魔抗": 0, 
		"物穿": 10, 
		"魔穿": 10, 
		"暴击减免": 0, 
		"速度": 9, 
		"视野": 300, 
		"攻击范围": 145, 
		"攻击欲望": 90, 
		"回血": 0, 
		"经验": 110, 
		"金币": 90, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 225, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_80", 
		"显示名": "天兵枪"
	}, 
	"tbg": {
		"名字": "天兵·弓", 
		"等级": 35, 
		"生命": 6000, 
		"攻击间隔": 10, 
		"物防": 130, 
		"魔防": 130, 
		"暴击": 25, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 58, 
		"魔抗": 0, 
		"物穿": 20, 
		"魔穿": 20, 
		"暴击减免": 0, 
		"速度": 14, 
		"视野": 800, 
		"攻击范围": 355, 
		"攻击欲望": 85, 
		"回血": 0, 
		"经验": 110, 
		"金币": 90, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 325, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_82", 
		"显示名": "天兵弓"
	}, 
	"tbf": {
		"名字": "天兵·斧", 
		"等级": 35, 
		"生命": "6000 + Stage * 3000", 
		"攻击间隔": 90, 
		"物防": "100 + Stage * 25", 
		"魔防": "100 + Stage * 25", 
		"暴击": "0 + Stage * 15", 
		"闪避": "0 + Stage * 5", 
		"幸运": "0 + Stage * 15", 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": "15 + Stage * 10", 
		"魔穿": "15 + Stage * 10", 
		"暴击减免": 0, 
		"速度": "8 + Stage * 2", 
		"视野": 500, 
		"攻击范围": 165, 
		"攻击欲望": "75 + Stage * 10", 
		"回血": 0, 
		"经验": 160, 
		"金币": 110, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": "150 + Stage * 45", 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_94", 
		"显示名": "天兵斧"
	}, 
	"tbc": {
		"名字": "天兵·锤", 
		"等级": 35, 
		"生命": "6000 + Stage * 3000", 
		"攻击间隔": 90, 
		"物防": "100 + Stage * 25", 
		"魔防": "100 + Stage * 25", 
		"暴击": "0 + Stage * 15", 
		"闪避": "0 + Stage * 5", 
		"幸运": "0 + Stage * 15", 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": "15 + Stage * 10", 
		"魔穿": "15 + Stage * 10", 
		"暴击减免": 0, 
		"速度": "8 + Stage * 2", 
		"视野": 500, 
		"攻击范围": 165, 
		"攻击欲望": "75 + Stage * 10", 
		"回血": 0, 
		"经验": 160, 
		"金币": 110, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": "150 + Stage * 45", 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_95", 
		"显示名": "天兵锤"
	}, 
	"zztw": {
		"名字": "增长天王", 
		"等级": 35, 
		"生命": 85000, 
		"攻击间隔": 10, 
		"物防": 170, 
		"魔防": 170, 
		"暴击": 20, 
		"闪避": 22, 
		"幸运": 0, 
		"命中": 18, 
		"魔抗": 0, 
		"物穿": 10, 
		"魔穿": 10, 
		"暴击减免": 0, 
		"速度": 10, 
		"视野": 600, 
		"攻击范围": 175, 
		"攻击欲望": 90, 
		"回血": 0, 
		"经验": 0, 
		"金币": 200, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 225, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 150, 
				"kind": "real"
			}, 
			{
				"name": "hit3", 
				"power": 325, 
				"kind": "magic"
			}, 
			{
				"name": "hit4", 
				"power": 325, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_83", 
		"显示名": "增长天王"
	}, 
	"gmtw": {
		"名字": "广目天王", 
		"等级": 35, 
		"生命": 90000, 
		"攻击间隔": 10, 
		"物防": 170, 
		"魔防": 170, 
		"暴击": 0, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 18, 
		"魔抗": 0, 
		"物穿": 10, 
		"魔穿": 10, 
		"暴击减免": 0, 
		"速度": 10, 
		"视野": 300, 
		"攻击范围": 165, 
		"攻击欲望": 90, 
		"回血": 0, 
		"经验": 0, 
		"金币": 200, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 225, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 300, 
				"kind": "real"
			}, 
			{
				"name": "hit3", 
				"power": 350, 
				"kind": "magic"
			}, 
			{
				"name": "hit4", 
				"power": 225, 
				"kind": "real"
			}, 
			{
				"name": "hit5", 
				"power": 325, 
				"kind": "real"
			}, 
			{
				"name": "hit6", 
				"power": 325, 
				"kind": "real"
			}
		], 
		"脚本": "Monster_84", 
		"显示名": "广目天王"
	}, 
	"dwtw": {
		"名字": "多闻天王", 
		"等级": 35, 
		"生命": 100000, 
		"攻击间隔": 10, 
		"物防": 170, 
		"魔防": 170, 
		"暴击": 0, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 18, 
		"魔抗": 0, 
		"物穿": 10, 
		"魔穿": 10, 
		"暴击减免": 0, 
		"速度": 10, 
		"视野": 300, 
		"攻击范围": 165, 
		"攻击欲望": 90, 
		"回血": 0, 
		"经验": 0, 
		"金币": 200, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 225, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 0, 
				"kind": "real"
			}, 
			{
				"name": "hit3", 
				"power": 300, 
				"kind": "magic"
			}, 
			{
				"name": "hit4", 
				"power": 325, 
				"kind": "real"
			}, 
			{
				"name": "hit5", 
				"power": 225, 
				"kind": "real"
			}, 
			{
				"name": "hit6", 
				"power": 225, 
				"kind": "real"
			}
		], 
		"脚本": "Monster_85", 
		"显示名": "多闻天王"
	}, 
	"mtj": {
		"名字": "马天君", 
		"等级": 35, 
		"生命": 100000, 
		"攻击间隔": 90, 
		"物防": 180, 
		"魔防": 180, 
		"暴击": 20, 
		"闪避": 0, 
		"幸运": 40, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 25, 
		"魔穿": 25, 
		"暴击减免": 0, 
		"速度": 12, 
		"视野": 500, 
		"攻击范围": 165, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 0, 
		"金币": 0, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 400, 
				"kind": "physics"
			}, 
			{
				"name": "hit2", 
				"power": 350, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 400, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_134", 
		"显示名": "马天君"
	}, 
	"cgtw": {
		"名字": "持国天王", 
		"等级": 35, 
		"生命": 110000, 
		"攻击间隔": 90, 
		"物防": 150, 
		"魔防": 150, 
		"暴击": 20, 
		"闪避": 20, 
		"幸运": 0, 
		"命中": 20, 
		"魔抗": 20, 
		"物穿": 25, 
		"魔穿": 25, 
		"暴击减免": 0, 
		"速度": 13, 
		"视野": 500, 
		"攻击范围": 145, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 200, 
		"金币": 135, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 300, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 350, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_137", 
		"显示名": "持国天王"
	}, 
	"zzz": {
		"名字": "朱子真", 
		"等级": 35, 
		"生命": 120000, 
		"攻击间隔": 90, 
		"物防": 180, 
		"魔防": 180, 
		"暴击": 0, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 70, 
		"魔抗": 20, 
		"物穿": 35, 
		"魔穿": 35, 
		"暴击减免": 0, 
		"速度": 10, 
		"视野": 500, 
		"攻击范围": 185, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 0, 
		"金币": 300, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 400, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 500, 
				"kind": "physics"
			}, 
			{
				"name": "hit3", 
				"power": 900, 
				"kind": "magic"
			}, 
			{
				"name": "hit4", 
				"power": "hd", 
				"kind": "real"
			}, 
			{
				"name": "hit5", 
				"power": 400, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_89", 
		"显示名": "朱子真"
	}, 
	"yuh": {
		"名字": "袁洪", 
		"等级": 35, 
		"生命": 130000, 
		"攻击间隔": 90, 
		"物防": 180, 
		"魔防": 180, 
		"暴击": 10, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 20, 
		"魔抗": 0, 
		"物穿": 20, 
		"魔穿": 20, 
		"暴击减免": 0, 
		"速度": 9, 
		"视野": 500, 
		"攻击范围": 165, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 0, 
		"金币": 400, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 330, 
				"kind": "physics"
			}, 
			{
				"name": "hit2", 
				"power": "int(350 * Bl)", 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 350, 
				"kind": "magic"
			}, 
			{
				"name": "hit4", 
				"power": 0, 
				"kind": "real"
			}, 
			{
				"name": "hit5", 
				"power": "int(RoleProp.roleprop.SHp * 10)", 
				"kind": "real"
			}
		], 
		"脚本": "Monster_91", 
		"显示名": "袁洪"
	}, 
	"els": {
		"名字": "二郎神", 
		"等级": 35, 
		"生命": 140000, 
		"攻击间隔": 90, 
		"物防": 180, 
		"魔防": 180, 
		"暴击": 0, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 0, 
		"魔穿": 0, 
		"暴击减免": 0, 
		"速度": 12, 
		"视野": 500, 
		"攻击范围": 165, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 0, 
		"金币": 500, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 500, 
				"kind": "physics"
			}, 
			{
				"name": "hit2", 
				"power": "int(RoleProp.roleprop.SHp * 0.3 + 1000)", 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 400, 
				"kind": "magic"
			}, 
			{
				"name": "hit4", 
				"power": 300, 
				"kind": "real"
			}, 
			{
				"name": "hit5", 
				"power": 300, 
				"kind": "real"
			}
		], 
		"脚本": "Monster_93", 
		"显示名": "二郎神"
	}, 
	"goy": {
		"名字": "狗妖", 
		"等级": 35, 
		"生命": 10000, 
		"攻击间隔": 90, 
		"物防": 150, 
		"魔防": 150, 
		"暴击": 0, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 35, 
		"魔穿": 35, 
		"暴击减免": 0, 
		"速度": 10, 
		"视野": 500, 
		"攻击范围": 155, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 150, 
		"金币": 110, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 250, 
				"kind": "real"
			}
		], 
		"脚本": "Monster_86", 
		"显示名": "狗妖"
	}, 
	"yy": {
		"名字": "羊妖", 
		"等级": 35, 
		"生命": 13000, 
		"攻击间隔": 90, 
		"物防": 150, 
		"魔防": 150, 
		"暴击": 0, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 35, 
		"魔穿": 35, 
		"暴击减免": 0, 
		"速度": 10, 
		"视野": 500, 
		"攻击范围": 265, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 150, 
		"金币": 110, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 130, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_87", 
		"显示名": "羊妖"
	}, 
	"ny": {
		"名字": "牛妖", 
		"等级": 35, 
		"生命": 12000, 
		"攻击间隔": 90, 
		"物防": 140, 
		"魔防": 140, 
		"暴击": 0, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 70, 
		"魔抗": 70, 
		"物穿": 35, 
		"魔穿": 35, 
		"暴击减免": 0, 
		"速度": 8, 
		"视野": 500, 
		"攻击范围": 165, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 150, 
		"金币": 110, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 150, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 200, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_88", 
		"显示名": "牛妖"
	}, 
	"sey": {
		"名字": "蛇妖", 
		"等级": 35, 
		"生命": 15000, 
		"攻击间隔": 90, 
		"物防": 120, 
		"魔防": 150, 
		"暴击": 20, 
		"闪避": 20, 
		"幸运": 0, 
		"命中": 20, 
		"魔抗": 20, 
		"物穿": 25, 
		"魔穿": 25, 
		"暴击减免": 0, 
		"速度": 13, 
		"视野": 500, 
		"攻击范围": 365, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 150, 
		"金币": 110, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 300, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_90", 
		"显示名": "蛇妖"
	}, 
	"wgj": {
		"名字": "蜈蚣精", 
		"等级": 35, 
		"生命": 16000, 
		"攻击间隔": 90, 
		"物防": 150, 
		"魔防": 150, 
		"暴击": 0, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 25, 
		"魔抗": 70, 
		"物穿": 15, 
		"魔穿": 15, 
		"暴击减免": 0, 
		"速度": 8, 
		"视野": 500, 
		"攻击范围": 165, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 170, 
		"金币": 120, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 300, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 200, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_92", 
		"显示名": "蜈蚣精"
	}, 
	"hdhw": {
		"名字": "黑雕护卫", 
		"等级": 40, 
		"生命": "8000 + Global.LLBTLevel * 350", 
		"攻击间隔": 60, 
		"物防": "90 + Global.LLBTLevel * 2", 
		"魔防": "90 + Global.LLBTLevel * 2", 
		"暴击": "0 + Global.LLBTLevel * 1.5", 
		"闪避": "0 + Global.LLBTLevel * 1", 
		"幸运": "0 + Global.LLBTLevel * 10", 
		"命中": "0 + Global.LLBTLevel * 1", 
		"魔抗": 0, 
		"物穿": "7 + Global.LLBTLevel * 1", 
		"魔穿": "7 + Global.LLBTLevel * 1", 
		"暴击减免": 0, 
		"速度": 15, 
		"视野": 500, 
		"攻击范围": 255, 
		"攻击欲望": 100, 
		"回血": 0, 
		"经验": "60 + Global.LLBTLevel * 5", 
		"金币": "70 + Global.LLBTLevel * 6", 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": "270 + Global.LLBTLevel * 10", 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_99", 
		"显示名": "黑雕护卫"
	}, 
	"cdhw": {
		"名字": "长刀护卫", 
		"等级": 40, 
		"生命": "7000 + Global.LLBTLevel * 400", 
		"攻击间隔": 60, 
		"物防": "110 + Global.LLBTLevel * 2", 
		"魔防": "110 + Global.LLBTLevel * 2", 
		"暴击": "0 + Global.LLBTLevel * 2", 
		"闪避": "0 + Global.LLBTLevel * 1", 
		"幸运": "0 + Global.LLBTLevel * 5", 
		"命中": "0 + Global.LLBTLevel * 2", 
		"魔抗": 0, 
		"物穿": "7 + Global.LLBTLevel * 1", 
		"魔穿": "7 + Global.LLBTLevel * 1", 
		"暴击减免": 0, 
		"速度": 12, 
		"视野": 500, 
		"攻击范围": 175, 
		"攻击欲望": 100, 
		"回血": 0, 
		"经验": "60 + Global.LLBTLevel * 5", 
		"金币": "75 + Global.LLBTLevel * 6", 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": "350 + Global.LLBTLevel * 5", 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_98", 
		"显示名": "长刀护卫"
	}, 
	"jdhw": {
		"名字": "巨盾护卫", 
		"等级": 40, 
		"生命": "9000 + Global.LLBTLevel * 500", 
		"攻击间隔": 60, 
		"物防": "140 + Global.LLBTLevel * 2", 
		"魔防": "140 + Global.LLBTLevel * 2", 
		"暴击": "0 + Global.LLBTLevel * 1.5", 
		"闪避": "0 + Global.LLBTLevel * 1", 
		"幸运": "0 + Global.LLBTLevel * 3", 
		"命中": "0 + Global.LLBTLevel * 1.5", 
		"魔抗": 0, 
		"物穿": "6 + Global.LLBTLevel * 1", 
		"魔穿": "6 + Global.LLBTLevel * 1", 
		"暴击减免": 0, 
		"速度": 8, 
		"视野": 500, 
		"攻击范围": 125, 
		"攻击欲望": 100, 
		"回血": 0, 
		"经验": "60 + Global.LLBTLevel * 5", 
		"金币": "70 + Global.LLBTLevel * 6", 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": "330 + Global.LLBTLevel * 6", 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_97", 
		"显示名": "巨盾护卫"
	}, 
	"txs": {
		"名字": "土行孙", 
		"等级": 40, 
		"生命": 120000, 
		"攻击间隔": 60, 
		"物防": 165, 
		"魔防": 165, 
		"暴击": 35, 
		"闪避": 25, 
		"幸运": 15, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 30, 
		"魔穿": 30, 
		"暴击减免": 0, 
		"速度": 11, 
		"视野": 500, 
		"攻击范围": 145, 
		"攻击欲望": 100, 
		"回血": 0, 
		"经验": 120, 
		"金币": 155, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 350, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 350, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 400, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_100", 
		"显示名": "土行孙"
	}, 
	"lzz": {
		"名字": "雷震子", 
		"等级": 40, 
		"生命": 140000, 
		"攻击间隔": 60, 
		"物防": 180, 
		"魔防": 180, 
		"暴击": 50, 
		"闪避": 25, 
		"幸运": 115, 
		"命中": 35, 
		"魔抗": 0, 
		"物穿": 30, 
		"魔穿": 30, 
		"暴击减免": 0, 
		"速度": 16, 
		"视野": 500, 
		"攻击范围": 245, 
		"攻击欲望": 100, 
		"回血": 0, 
		"经验": 120, 
		"金币": 155, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 350, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 250, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 500, 
				"kind": "magic"
			}, 
			{
				"name": "hit4", 
				"power": 350, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_101", 
		"显示名": "雷震子"
	}, 
	"nz": {
		"名字": "哪吒", 
		"等级": 40, 
		"生命": 150000, 
		"攻击间隔": 60, 
		"物防": 180, 
		"魔防": 180, 
		"暴击": 50, 
		"闪避": 25, 
		"幸运": 115, 
		"命中": 35, 
		"魔抗": 0, 
		"物穿": 30, 
		"魔穿": 30, 
		"暴击减免": 0, 
		"速度": 16, 
		"视野": 500, 
		"攻击范围": 245, 
		"攻击欲望": 100, 
		"回血": 0, 
		"经验": 120, 
		"金币": 155, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 350, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 405, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 650, 
				"kind": "magic"
			}, 
			{
				"name": "hit4", 
				"power": 0, 
				"kind": ""
			}
		], 
		"脚本": "Monster_102", 
		"显示名": "哪吒"
	}, 
	"tttw": {
		"名字": "托塔天王", 
		"等级": 40, 
		"生命": 180000, 
		"攻击间隔": 60, 
		"物防": 180, 
		"魔防": 180, 
		"暴击": 50, 
		"闪避": 25, 
		"幸运": 115, 
		"命中": 35, 
		"魔抗": 0, 
		"物穿": 30, 
		"魔穿": 30, 
		"暴击减免": 0, 
		"速度": 16, 
		"视野": 500, 
		"攻击范围": 245, 
		"攻击欲望": 100, 
		"回血": 0, 
		"经验": 120, 
		"金币": 155, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 300, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 355, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": "int(200 + RoleProp.roleprop.SHp * 0.3)", 
				"kind": "magic"
			}, 
			{
				"name": "hit4", 
				"power": 200, 
				"kind": "real"
			}
		], 
		"脚本": "Monster_103", 
		"显示名": "托塔天王"
	}, 
	"lhtz": {
		"名字": "硫磺童子", 
		"等级": 50, 
		"生命": 15000, 
		"攻击间隔": 90, 
		"物防": 180, 
		"魔防": 180, 
		"暴击": 20, 
		"闪避": 20, 
		"幸运": 0, 
		"命中": 20, 
		"魔抗": 20, 
		"物穿": 25, 
		"魔穿": 25, 
		"暴击减免": 0, 
		"速度": 11, 
		"视野": 500, 
		"攻击范围": 365, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 220, 
		"金币": 220, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 300, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 600, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_104", 
		"显示名": "硫磺童子"
	}, 
	"wdtz": {
		"名字": "巫毒童子", 
		"等级": 50, 
		"生命": 13000, 
		"攻击间隔": 90, 
		"物防": 150, 
		"魔防": 150, 
		"暴击": 20, 
		"闪避": 20, 
		"幸运": 0, 
		"命中": 20, 
		"魔抗": 20, 
		"物穿": 25, 
		"魔穿": 25, 
		"暴击减免": 0, 
		"速度": 11, 
		"视野": 500, 
		"攻击范围": 365, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 220, 
		"金币": 220, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 120, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_105", 
		"显示名": "巫毒童子"
	}, 
	"ghtz": {
		"名字": "勾魂童子", 
		"等级": 50, 
		"生命": 17000, 
		"攻击间隔": 90, 
		"物防": 180, 
		"魔防": 180, 
		"暴击": 20, 
		"闪避": 20, 
		"幸运": 0, 
		"命中": 20, 
		"魔抗": 20, 
		"物穿": 25, 
		"魔穿": 25, 
		"暴击减免": 0, 
		"速度": 11, 
		"视野": 500, 
		"攻击范围": 335, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 220, 
		"金币": 220, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 500, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_106", 
		"显示名": "勾魂童子"
	}, 
	"yntz": {
		"名字": "隐匿童子", 
		"等级": 50, 
		"生命": 15000, 
		"攻击间隔": 90, 
		"物防": 150, 
		"魔防": 150, 
		"暴击": 20, 
		"闪避": 20, 
		"幸运": 0, 
		"命中": 20, 
		"魔抗": 20, 
		"物穿": 25, 
		"魔穿": 25, 
		"暴击减免": 0, 
		"速度": 11, 
		"视野": 500, 
		"攻击范围": 165, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 220, 
		"金币": 220, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 500, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_109", 
		"显示名": "隐匿童子"
	}, 
	"rstz": {
		"名字": "人参童子", 
		"等级": 50, 
		"生命": 16000, 
		"攻击间隔": 90, 
		"物防": 150, 
		"魔防": 150, 
		"暴击": 20, 
		"闪避": 20, 
		"幸运": 0, 
		"命中": 20, 
		"魔抗": 20, 
		"物穿": 25, 
		"魔穿": 25, 
		"暴击减免": 0, 
		"速度": 11, 
		"视野": 500, 
		"攻击范围": 165, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 220, 
		"金币": 220, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 500, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_111", 
		"显示名": "人参童子"
	}, 
	"dhtz": {
		"名字": "电魂童子", 
		"等级": 50, 
		"生命": 15000, 
		"攻击间隔": 90, 
		"物防": 120, 
		"魔防": 150, 
		"暴击": 20, 
		"闪避": 20, 
		"幸运": 0, 
		"命中": 20, 
		"魔抗": 20, 
		"物穿": 25, 
		"魔穿": 25, 
		"暴击减免": 0, 
		"速度": 11, 
		"视野": 500, 
		"攻击范围": 165, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 220, 
		"金币": 220, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 500, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 500, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_113", 
		"显示名": "电魂童子"
	}, 
	"yjdw": {
		"名字": "银角大王", 
		"等级": 50, 
		"生命": 200000, 
		"攻击间隔": 90, 
		"物防": 180, 
		"魔防": 180, 
		"暴击": 20, 
		"闪避": 20, 
		"幸运": 0, 
		"命中": 20, 
		"魔抗": 20, 
		"物穿": 35, 
		"魔穿": 35, 
		"暴击减免": 0, 
		"速度": 11, 
		"视野": 500, 
		"攻击范围": 335, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 300, 
		"金币": 335, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 500, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 350, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 800, 
				"kind": "magic"
			}, 
			{
				"name": "hit4", 
				"power": 350, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_107", 
		"显示名": "银角大王"
	}, 
	"jjdw": {
		"名字": "金角大王", 
		"等级": 50, 
		"生命": 300000, 
		"攻击间隔": 90, 
		"物防": 180, 
		"魔防": 180, 
		"暴击": 20, 
		"闪避": 20, 
		"幸运": 0, 
		"命中": 20, 
		"魔抗": 20, 
		"物穿": 35, 
		"魔穿": 35, 
		"暴击减免": 0, 
		"速度": 11, 
		"视野": 500, 
		"攻击范围": 235, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 300, 
		"金币": 335, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 500, 
				"kind": "physics"
			}, 
			{
				"name": "hit2", 
				"power": 520, 
				"kind": "physics"
			}, 
			{
				"name": "hit3", 
				"power": "int(1000 + RoleProp.roleprop.SHp * 0.35)", 
				"kind": "real"
			}, 
			{
				"name": "hit4", 
				"power": 450, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_108", 
		"显示名": "金角大王"
	}, 
	"qnj": {
		"名字": "青牛精", 
		"等级": 50, 
		"生命": 300000, 
		"攻击间隔": 90, 
		"物防": 180, 
		"魔防": 180, 
		"暴击": 20, 
		"闪避": 20, 
		"幸运": 0, 
		"命中": 20, 
		"魔抗": 20, 
		"物穿": 35, 
		"魔穿": 35, 
		"暴击减免": 0, 
		"速度": 11, 
		"视野": 500, 
		"攻击范围": 235, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 300, 
		"金币": 335, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 300, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 400, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 800, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_110", 
		"显示名": "青牛精"
	}, 
	"tbjx": {
		"名字": "太白金星", 
		"等级": 50, 
		"生命": 300000, 
		"攻击间隔": 90, 
		"物防": 150, 
		"魔防": 150, 
		"暴击": 20, 
		"闪避": 20, 
		"幸运": 0, 
		"命中": 20, 
		"魔抗": 20, 
		"物穿": 35, 
		"魔穿": 35, 
		"暴击减免": 0, 
		"速度": 14, 
		"视野": 500, 
		"攻击范围": 235, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 300, 
		"金币": 335, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 500, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 1500, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 1500, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_112", 
		"显示名": "太白金星"
	}, 
	"tslj": {
		"名字": "太上老君", 
		"等级": 50, 
		"生命": 400000, 
		"攻击间隔": 90, 
		"物防": 200, 
		"魔防": 200, 
		"暴击": 20, 
		"闪避": 20, 
		"幸运": 0, 
		"命中": 20, 
		"魔抗": 20, 
		"物穿": 35, 
		"魔穿": 35, 
		"暴击减免": 0, 
		"速度": 11, 
		"视野": 500, 
		"攻击范围": 235, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 300, 
		"金币": 335, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 500, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 700, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 600, 
				"kind": "magic"
			}, 
			{
				"name": "hit4", 
				"power": 800, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_114", 
		"显示名": "太上老君"
	}, 
	"hlhw": {
		"名字": "火龙护卫", 
		"等级": 55, 
		"生命": 45000, 
		"攻击间隔": 20, 
		"物防": 300, 
		"魔防": 300, 
		"暴击": 25, 
		"闪避": 25, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 60, 
		"魔穿": 60, 
		"暴击减免": 0, 
		"速度": 12, 
		"视野": 600, 
		"攻击范围": 225, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 240, 
		"金币": 240, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 500, 
				"kind": "physics"
			}, 
			{
				"name": "hit2", 
				"power": 800, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_115", 
		"显示名": "火龙护卫"
	}, 
	"hylqs": {
		"名字": "黑烟炼气师", 
		"等级": 55, 
		"生命": 45000, 
		"攻击间隔": 30, 
		"物防": 355, 
		"魔防": 365, 
		"暴击": 28, 
		"闪避": 28, 
		"幸运": 40, 
		"命中": 0, 
		"魔抗": 35, 
		"物穿": 65, 
		"魔穿": 65, 
		"暴击减免": 0, 
		"速度": 12, 
		"视野": 600, 
		"攻击范围": 135, 
		"攻击欲望": 85, 
		"回血": 0, 
		"经验": 100, 
		"金币": 30, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 500, 
				"kind": "physics"
			}, 
			{
				"name": "hit2", 
				"power": 800, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_120", 
		"显示名": "黑烟炼气师"
	}, 
	"emlqs": {
		"名字": "噩梦炼气师", 
		"等级": 55, 
		"生命": 45000, 
		"攻击间隔": 30, 
		"物防": 355, 
		"魔防": 365, 
		"暴击": 28, 
		"闪避": 28, 
		"幸运": 40, 
		"命中": 0, 
		"魔抗": 35, 
		"物穿": 65, 
		"魔穿": 65, 
		"暴击减免": 0, 
		"速度": 12, 
		"视野": 600, 
		"攻击范围": 135, 
		"攻击欲望": 85, 
		"回血": 0, 
		"经验": 100, 
		"金币": 30, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 500, 
				"kind": "physics"
			}, 
			{
				"name": "hit2", 
				"power": 800, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_119", 
		"显示名": "噩梦炼气师"
	}, 
	"yflqs": {
		"名字": "妖风炼气师", 
		"等级": 55, 
		"生命": 45000, 
		"攻击间隔": 30, 
		"物防": 355, 
		"魔防": 365, 
		"暴击": 28, 
		"闪避": 28, 
		"幸运": 40, 
		"命中": 0, 
		"魔抗": 35, 
		"物穿": 65, 
		"魔穿": 65, 
		"暴击减免": 0, 
		"速度": 12, 
		"视野": 600, 
		"攻击范围": 135, 
		"攻击欲望": 85, 
		"回血": 0, 
		"经验": 100, 
		"金币": 30, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 500, 
				"kind": "physics"
			}, 
			{
				"name": "hit2", 
				"power": 800, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_122", 
		"显示名": "妖风炼气师"
	}, 
	"dylqs": {
		"名字": "妖风炼气师", 
		"等级": 55, 
		"生命": 45000, 
		"攻击间隔": 30, 
		"物防": 355, 
		"魔防": 365, 
		"暴击": 28, 
		"闪避": 28, 
		"幸运": 40, 
		"命中": 0, 
		"魔抗": 35, 
		"物穿": 65, 
		"魔穿": 65, 
		"暴击减免": 0, 
		"速度": 12, 
		"视野": 600, 
		"攻击范围": 135, 
		"攻击欲望": 85, 
		"回血": 0, 
		"经验": 100, 
		"金币": 30, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 500, 
				"kind": "physics"
			}, 
			{
				"name": "hit2", 
				"power": 800, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_122", 
		"显示名": "地狱炼气师"
	}, 
	"hbsz": {
		"名字": "花豹圣者·高友乾", 
		"等级": 55, 
		"生命": 600000, 
		"攻击间隔": 95, 
		"物防": 420, 
		"魔防": 420, 
		"暴击": 18, 
		"闪避": 38, 
		"幸运": 45, 
		"命中": 80, 
		"魔抗": 5, 
		"物穿": 60, 
		"魔穿": 60, 
		"暴击减免": 5, 
		"速度": 13, 
		"视野": 550, 
		"攻击范围": 350, 
		"攻击欲望": 75, 
		"回血": 2000, 
		"经验": 2500, 
		"金币": 1000, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 550, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 440, 
				"kind": "physics"
			}, 
			{
				"name": "hit2_2", 
				"power": 600, 
				"kind": "physics"
			}, 
			{
				"name": "hit2_3", 
				"power": 800, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 0, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_1401", 
		"显示名": "花豹圣者·高友乾"
	}, 
	"jnsz": {
		"名字": "狻猊圣者·杨森", 
		"等级": 56, 
		"生命": 750000, 
		"攻击间隔": 100, 
		"物防": 440, 
		"魔防": 440, 
		"暴击": 20, 
		"闪避": 40, 
		"幸运": 50, 
		"命中": 85, 
		"魔抗": 10, 
		"物穿": 70, 
		"魔穿": 70, 
		"暴击减免": 8, 
		"速度": 14, 
		"视野": 550, 
		"攻击范围": 375, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 3000, 
		"金币": 1200, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 600, 
				"kind": "physics"
			}, 
			{
				"name": "hit2", 
				"power": 550, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 550, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_1402", 
		"显示名": "狻猊圣者·杨森"
	}, 
	"basz": {
		"名字": "狴犴圣者·王魔", 
		"等级": 56, 
		"生命": 900000, 
		"攻击间隔": 105, 
		"物防": 470, 
		"魔防": 470, 
		"暴击": 22, 
		"闪避": 42, 
		"幸运": 55, 
		"命中": 85, 
		"魔抗": 15, 
		"物穿": 80, 
		"魔穿": 80, 
		"暴击减免": 10, 
		"速度": 15, 
		"视野": 550, 
		"攻击范围": 400, 
		"攻击欲望": 85, 
		"回血": 0, 
		"经验": 3500, 
		"金币": 1400, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 650, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 9999999, 
				"kind": "real"
			}, 
			{
				"name": "hit3", 
				"power": 600, 
				"kind": "magic"
			}, 
			{
				"name": "hit3_2", 
				"power": 650, 
				"kind": "magic"
			}, 
			{
				"name": "hit3_1", 
				"power": 600, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_1403", 
		"显示名": "狴犴圣者·王魔"
	}, 
	"znsz": {
		"名字": "碧霄", 
		"等级": 57, 
		"生命": 1100000, 
		"攻击间隔": 110, 
		"物防": 500, 
		"魔防": 500, 
		"暴击": 25, 
		"闪避": 45, 
		"幸运": 60, 
		"命中": 90, 
		"魔抗": 20, 
		"物穿": 90, 
		"魔穿": 90, 
		"暴击减免": 12, 
		"速度": 16, 
		"视野": 1000, 
		"攻击范围": 600, 
		"攻击欲望": 90, 
		"回血": 0, 
		"经验": 4000, 
		"金币": 1600, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 700, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 700, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 800, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_1404", 
		"显示名": "狰狞圣者"
	}, 
	"ly": {
		"名字": "魔王吕岳", 
		"等级": 57, 
		"生命": 1300000, 
		"攻击间隔": 115, 
		"物防": 540, 
		"魔防": 540, 
		"暴击": 28, 
		"闪避": 40, 
		"幸运": 65, 
		"命中": 90, 
		"魔抗": 25, 
		"物穿": 100, 
		"魔穿": 100, 
		"暴击减免": 15, 
		"速度": 16, 
		"视野": 500, 
		"攻击范围": 350, 
		"攻击欲望": 95, 
		"回血": 3000, 
		"经验": 4500, 
		"金币": 1800, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 750, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 700, 
				"kind": "real"
			}, 
			{
				"name": "hit3", 
				"power": 400, 
				"kind": "magic"
			}, 
			{
				"name": "hit4", 
				"power": 400, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_1405", 
		"显示名": "吕岳"
	}, 
	"yzx": {
		"名字": "焰中仙", 
		"等级": 55, 
		"生命": 500000, 
		"攻击间隔": 90, 
		"物防": 400, 
		"魔防": 400, 
		"暴击": 20, 
		"闪避": 40, 
		"幸运": 50, 
		"命中": 15, 
		"魔抗": 0, 
		"物穿": 50, 
		"魔穿": 50, 
		"暴击减免": 0, 
		"速度": 14, 
		"视野": 500, 
		"攻击范围": 325, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 0, 
		"金币": 500, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 500, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 450, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 550, 
				"kind": "magic"
			}, 
			{
				"name": "hit4", 
				"power": 800, 
				"kind": "real"
			}, 
			{
				"name": "hit5", 
				"power": 800, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_140", 
		"显示名": "焰中仙"
	}, 
	"fyj": {
		"名字": "飞烟剑", 
		"等级": 55, 
		"生命": 300000, 
		"攻击间隔": 60, 
		"物防": 350, 
		"魔防": 400, 
		"暴击": 0, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 20, 
		"魔穿": 20, 
		"暴击减免": 0, 
		"速度": 14, 
		"视野": 500, 
		"攻击范围": 325, 
		"攻击欲望": 90, 
		"回血": 0, 
		"经验": 15, 
		"金币": 4, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 600, 
				"kind": "real"
			}, 
			{
				"name": "hit2", 
				"power": 500, 
				"kind": "real"
			}
		], 
		"脚本": "Monster_117", 
		"显示名": "飞烟剑"
	}, 
	"wll": {
		"名字": "五龙轮", 
		"等级": 55, 
		"生命": 300000, 
		"攻击间隔": 60, 
		"物防": 350, 
		"魔防": 400, 
		"暴击": 0, 
		"闪避": 0, 
		"幸运": 0, 
		"命中": 0, 
		"魔抗": 0, 
		"物穿": 20, 
		"魔穿": 20, 
		"暴击减免": 0, 
		"速度": 14, 
		"视野": 500, 
		"攻击范围": 205, 
		"攻击欲望": 90, 
		"回血": 0, 
		"经验": 15, 
		"金币": 4, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 400, 
				"kind": "real"
			}
		], 
		"脚本": "Monster_116", 
		"显示名": "五龙轮"
	}, 
	"lzg": {
		"名字": "雷钻怪", 
		"等级": 55, 
		"生命": 65000, 
		"攻击间隔": 30, 
		"物防": 355, 
		"魔防": 365, 
		"暴击": 28, 
		"闪避": 28, 
		"幸运": 40, 
		"命中": 0, 
		"魔抗": 35, 
		"物穿": 65, 
		"魔穿": 65, 
		"暴击减免": 0, 
		"速度": 12, 
		"视野": 600, 
		"攻击范围": 135, 
		"攻击欲望": 85, 
		"回血": 0, 
		"经验": 100, 
		"金币": 30, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 1000, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_124", 
		"显示名": "雷钻怪"
	}, 
	"fl": {
		"名字": "凤翎", 
		"等级": 55, 
		"生命": 55000, 
		"攻击间隔": 30, 
		"物防": 355, 
		"魔防": 365, 
		"暴击": 28, 
		"闪避": 28, 
		"幸运": 40, 
		"命中": 0, 
		"魔抗": 35, 
		"物穿": 65, 
		"魔穿": 65, 
		"暴击减免": 0, 
		"速度": 12, 
		"视野": 600, 
		"攻击范围": 135, 
		"攻击欲望": 85, 
		"回血": 0, 
		"经验": 100, 
		"金币": 30, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 1000, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_123", 
		"显示名": "凤翎"
	}, 
	"bx": {
		"名字": "碧霄", 
		"等级": 57, 
		"生命": 1100000, 
		"攻击间隔": 110, 
		"物防": 500, 
		"魔防": 500, 
		"暴击": 25, 
		"闪避": 45, 
		"幸运": 60, 
		"命中": 90, 
		"魔抗": 20, 
		"物穿": 90, 
		"魔穿": 90, 
		"暴击减免": 12, 
		"速度": 16, 
		"视野": 1000, 
		"攻击范围": 600, 
		"攻击欲望": 90, 
		"回血": 0, 
		"经验": 4000, 
		"金币": 1600, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 700, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 700, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 800, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_1404", 
		"显示名": "碧霄"
	}, 
	"qx": {
		"名字": "琼霄", 
		"等级": 58, 
		"生命": 1500000, 
		"攻击间隔": 120, 
		"物防": 580, 
		"魔防": 580, 
		"暴击": 30, 
		"闪避": 50, 
		"幸运": 70, 
		"命中": 95, 
		"魔抗": 30, 
		"物穿": 110, 
		"魔穿": 110, 
		"暴击减免": 18, 
		"速度": 18, 
		"视野": 600, 
		"攻击范围": 500, 
		"攻击欲望": 95, 
		"回血": 0, 
		"经验": 5000, 
		"金币": 2000, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 800, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 800, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 1200, 
				"kind": "magic"
			}, 
			{
				"name": "hit4", 
				"power": 0, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_1406", 
		"显示名": "琼霄"
	}, 
	"yx": {
		"名字": "狻猊圣者·杨森", 
		"等级": 56, 
		"生命": 750000, 
		"攻击间隔": 100, 
		"物防": 440, 
		"魔防": 440, 
		"暴击": 20, 
		"闪避": 40, 
		"幸运": 50, 
		"命中": 85, 
		"魔抗": 10, 
		"物穿": 70, 
		"魔穿": 70, 
		"暴击减免": 8, 
		"速度": 14, 
		"视野": 550, 
		"攻击范围": 375, 
		"攻击欲望": 80, 
		"回血": 0, 
		"经验": 3000, 
		"金币": 1200, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 600, 
				"kind": "physics"
			}, 
			{
				"name": "hit2", 
				"power": 550, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 550, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_1402", 
		"显示名": "云霄"
	}, 
	"qnyw": {
		"名字": "千年妖蚊", 
		"等级": 59, 
		"生命": 1950000, 
		"攻击间隔": 130, 
		"物防": 680, 
		"魔防": 680, 
		"暴击": 38, 
		"闪避": 58, 
		"幸运": 83, 
		"命中": 98, 
		"魔抗": 43, 
		"物穿": 120, 
		"魔穿": 120, 
		"暴击减免": 20, 
		"速度": 18, 
		"视野": 550, 
		"攻击范围": 280, 
		"攻击欲望": 100, 
		"回血": 0, 
		"经验": 6000, 
		"金币": 2500, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 1000, 
				"kind": "physics"
			}, 
			{
				"name": "hit2", 
				"power": 900, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 1500, 
				"kind": "physics"
			}, 
			{
				"name": "hit5", 
				"power": 1800, 
				"kind": "real"
			}
		], 
		"脚本": "Monster_1408", 
		"显示名": "千年妖蚊"
	}, 
	"qnyc": {
		"名字": "千年妖蝉", 
		"等级": 59, 
		"生命": 2100000, 
		"攻击间隔": 130, 
		"物防": 680, 
		"魔防": 680, 
		"暴击": 38, 
		"闪避": 58, 
		"幸运": 83, 
		"命中": 98, 
		"魔抗": 43, 
		"物穿": 120, 
		"魔穿": 120, 
		"暴击减免": 20, 
		"速度": 15, 
		"视野": 550, 
		"攻击范围": 160, 
		"攻击欲望": 100, 
		"回血": 0, 
		"经验": "6000 if is_boss_flag else 3000", 
		"金币": "2500 if is_boss_flag else 1250", 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 1500, 
				"kind": "physics"
			}, 
			{
				"name": "hit2", 
				"power": 1700, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 1800, 
				"kind": "physics"
			}, 
			{
				"name": "hit4", 
				"power": 0, 
				"kind": "real"
			}, 
			{
				"name": "hit5", 
				"power": 0, 
				"kind": "real"
			}, 
			{
				"name": "hit6", 
				"power": 10, 
				"kind": "real"
			}
		], 
		"脚本": "Monster_1410", 
		"显示名": "千年妖蝉"
	}, 
	"qnwg": {
		"名字": "千年蜈蚣", 
		"等级": 59, 
		"生命": 1950000, 
		"攻击间隔": 130, 
		"物防": 680, 
		"魔防": 680, 
		"暴击": 38, 
		"闪避": 58, 
		"幸运": 83, 
		"命中": 98, 
		"魔抗": 43, 
		"物穿": 120, 
		"魔穿": 120, 
		"暴击减免": 20, 
		"速度": 15, 
		"视野": 550, 
		"攻击范围": 280, 
		"攻击欲望": 100, 
		"回血": 0, 
		"经验": "6000 if is_boss_flag else 3000", 
		"金币": "2500 if is_boss_flag else 1250", 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 1200, 
				"kind": "physics"
			}, 
			{
				"name": "hit2", 
				"power": 1000, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 1500, 
				"kind": "physics"
			}, 
			{
				"name": "hit5", 
				"power": 1800, 
				"kind": "real"
			}
		], 
		"脚本": "Monster_1409", 
		"显示名": "千年蜈蚣"
	}, 
	"fyg": {
		"名字": "飞翼怪", 
		"等级": 55, 
		"生命": 550000, 
		"攻击间隔": 30, 
		"物防": 355, 
		"魔防": 365, 
		"暴击": 28, 
		"闪避": 28, 
		"幸运": 40, 
		"命中": 0, 
		"魔抗": 35, 
		"物穿": 65, 
		"魔穿": 65, 
		"暴击减免": 0, 
		"速度": 12, 
		"视野": 600, 
		"攻击范围": 135, 
		"攻击欲望": 85, 
		"回血": 0, 
		"经验": 100, 
		"金币": 30, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 1000, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_1301", 
		"显示名": "飞翼怪"
	}, 
	"cysj": {
		"名字": "赤月神君", 
		"等级": 60, 
		"生命": 5000000, 
		"攻击间隔": 78, 
		"物防": "1290 * phantom_multiplier", 
		"魔防": "1250 * phantom_multiplier", 
		"暴击": "38 * phantom_multiplier", 
		"闪避": "42 if not is_phantom else 30", 
		"幸运": "85 * phantom_multiplier", 
		"命中": 99999, 
		"魔抗": "30 * phantom_multiplier", 
		"物穿": "285 * phantom_multiplier", 
		"魔穿": "278 * phantom_multiplier", 
		"暴击减免": "25 * phantom_multiplier", 
		"速度": "19 * phantom_multiplier", 
		"视野": 750, 
		"攻击范围": 150, 
		"攻击欲望": "188 if not is_phantom else 80", 
		"回血": "SHp * (0.00015 if not is_phantom else 0.0001)", 
		"经验": 0, 
		"金币": "800 * phantom_multiplier", 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 2700, 
				"kind": "physics"
			}, 
			{
				"name": "hit2", 
				"power": 2700, 
				"kind": "physics"
			}, 
			{
				"name": "hit3", 
				"power": 5000, 
				"kind": "physics"
			}
		], 
		"脚本": "Monster_146", 
		"显示名": "赤月神君"
	}, 
	"bssj": {
		"名字": "白水神君", 
		"等级": 72, 
		"生命": 7200000, 
		"攻击间隔": 113, 
		"物防": 1858, 
		"魔防": 1800, 
		"暴击": 55, 
		"闪避": 60, 
		"幸运": 122, 
		"命中": 120000, 
		"魔抗": 43, 
		"物穿": 410, 
		"魔穿": 401, 
		"暴击减免": 36, 
		"速度": 28, 
		"视野": 900, 
		"攻击范围": 318, 
		"攻击欲望": 271, 
		"回血": "self.SHp * 0.00018", 
		"经验": 0, 
		"金币": 0, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 3888, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 3888, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 7200, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_148", 
		"显示名": "白水神君"
	}, 
	"zmjw": {
		"名字": "紫眸鹫王", 
		"等级": 60, 
		"生命": 6000000, 
		"攻击间隔": 94, 
		"物防": 1548, 
		"魔防": 1500, 
		"暴击": 46, 
		"闪避": 50, 
		"幸运": 102, 
		"命中": 99999, 
		"魔抗": 36, 
		"物穿": 342, 
		"魔穿": 334, 
		"暴击减免": 30, 
		"速度": 23, 
		"视野": 750, 
		"攻击范围": 265, 
		"攻击欲望": 226, 
		"回血": "self.SHp * 0.00015", 
		"经验": 0, 
		"金币": 960, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 3240, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 3240, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 6000, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_147", 
		"显示名": "紫眸鹫王"
	}, 
	"zqpw": {
		"名字": "紫睛鹏王", 
		"等级": 86, 
		"生命": 8640000, 
		"攻击间隔": 136, 
		"物防": 2230, 
		"魔防": 2160, 
		"暴击": 66, 
		"闪避": 72, 
		"幸运": 146, 
		"命中": 144000, 
		"魔抗": 52, 
		"物穿": 492, 
		"魔穿": 481, 
		"暴击减免": 43, 
		"速度": 34, 
		"视野": 1080, 
		"攻击范围": 382, 
		"攻击欲望": 325, 
		"回血": "self.SHp * 0.000216", 
		"经验": 0, 
		"金币": 0, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 4666, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 4666, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 8640, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_149", 
		"显示名": "紫晴鹏王"
	}, 
	"qysj": {
		"名字": "青阳神君", 
		"等级": 90, 
		"生命": 10640000, 
		"攻击间隔": 78, 
		"物防": 2790, 
		"魔防": 2790, 
		"暴击": 138, 
		"闪避": 100, 
		"幸运": 85, 
		"命中": 99999, 
		"魔抗": 0, 
		"物穿": 285, 
		"魔穿": 278, 
		"暴击减免": 25, 
		"速度": 25, 
		"视野": 99999, 
		"攻击范围": 650, 
		"攻击欲望": 188, 
		"回血": 1596, 
		"经验": 0, 
		"金币": "800 * phantom_multiplier", 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 5200, 
				"kind": "magic"
			}, 
			{
				"name": "hit2", 
				"power": 5200, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 7800, 
				"kind": "magic"
			}, 
			{
				"name": "hit4", 
				"power": 7200, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_212", 
		"显示名": "青阳神君"
	}, 
	"hyr": {
		"名字": "黑衣人", 
		"等级": 90, 
		"生命": 15000000, 
		"攻击间隔": 90, 
		"物防": 3700, 
		"魔防": 3700, 
		"暴击": 0, 
		"闪避": 150, 
		"幸运": 0, 
		"命中": 9999, 
		"魔抗": 0, 
		"物穿": 1000, 
		"魔穿": 1000, 
		"暴击减免": 0, 
		"速度": 25, 
		"视野": 1000, 
		"攻击范围": 150, 
		"攻击欲望": 100, 
		"回血": 0, 
		"经验": 20, 
		"金币": 800, 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 9000, 
				"kind": "physics"
			}, 
			{
				"name": "hit2", 
				"power": 12000, 
				"kind": "magic"
			}
		], 
		"脚本": "Monster_215", 
		"显示名": "黑衣人"
	}, 
	"ttjz2": {
		"名字": "千年蜈蚣", 
		"等级": 59, 
		"生命": 1950000, 
		"攻击间隔": 130, 
		"物防": 680, 
		"魔防": 680, 
		"暴击": 38, 
		"闪避": 58, 
		"幸运": 83, 
		"命中": 98, 
		"魔抗": 43, 
		"物穿": 120, 
		"魔穿": 120, 
		"暴击减免": 20, 
		"速度": 15, 
		"视野": 550, 
		"攻击范围": 280, 
		"攻击欲望": 100, 
		"回血": 0, 
		"经验": "6000 if is_boss_flag else 3000", 
		"金币": "2500 if is_boss_flag else 1250", 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 1200, 
				"kind": "physics"
			}, 
			{
				"name": "hit2", 
				"power": 1000, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 1500, 
				"kind": "physics"
			}, 
			{
				"name": "hit5", 
				"power": 1800, 
				"kind": "real"
			}
		], 
		"脚本": "Monster_1409", 
		"显示名": "通天教主2"
	}, 
	"ttjz3": {
		"名字": "千年妖蝉", 
		"等级": 59, 
		"生命": 2100000, 
		"攻击间隔": 130, 
		"物防": 680, 
		"魔防": 680, 
		"暴击": 38, 
		"闪避": 58, 
		"幸运": 83, 
		"命中": 98, 
		"魔抗": 43, 
		"物穿": 120, 
		"魔穿": 120, 
		"暴击减免": 20, 
		"速度": 15, 
		"视野": 550, 
		"攻击范围": 160, 
		"攻击欲望": 100, 
		"回血": 0, 
		"经验": "6000 if is_boss_flag else 3000", 
		"金币": "2500 if is_boss_flag else 1250", 
		"掉落概率": 0, 
		"攻击": [
			{
				"name": "hit1", 
				"power": 1500, 
				"kind": "physics"
			}, 
			{
				"name": "hit2", 
				"power": 1700, 
				"kind": "magic"
			}, 
			{
				"name": "hit3", 
				"power": 1800, 
				"kind": "physics"
			}, 
			{
				"name": "hit4", 
				"power": 0, 
				"kind": "real"
			}, 
			{
				"name": "hit5", 
				"power": 0, 
				"kind": "real"
			}, 
			{
				"name": "hit6", 
				"power": 10, 
				"kind": "real"
			}
		], 
		"脚本": "Monster_1410", 
		"显示名": "通天教主3"
	}, 
	"weiyang3007": {
		"名字": "金之祖巫", "等级": 90, "生命": 18000000, "基础攻击": 30000, 
		"物防": 4750, "魔防": 4750, "暴击": 700, "闪避": 150, "幸运": 0, 
		"命中": 480, "魔抗": 0, "物穿": 2900, "魔穿": 2900, "暴击减免": 0, 
		"速度": 0, "视野": 1200, "攻击范围": 1200, "攻击欲望": 100, "回血": 0, 
		"经验": 100, "金币": 280, "掉落概率": 0, 
		"攻击": [
			{"name": "hit1", "power": 45000, "kind": "magic"}, 
			{"name": "hit2", "power": 45000, "kind": "magic"}, 
			{"name": "hit3", "power": 30000, "kind": "magic"}
		], "脚本": "WeiyangPalaceBoss", "显示名": "金之祖巫"
	}, 
	"蘑菇精": {
		"名字": "蘑菇精", "等级": 90, "生命": 4295000, "基础攻击": 20000, 
		"物防": 1100, "魔防": 1100, "暴击": 300, "闪避": 150, "幸运": 0, 
		"命中": 280, "魔抗": 0, "物穿": 900, "魔穿": 900, "暴击减免": 0, 
		"速度": 11, "视野": 760, "攻击范围": 85, "攻击欲望": 100, "回血": 0, 
		"经验": 10, "金币": 8, "掉落概率": 0, 
		"攻击": [{"name": "hit1", "power": 10000, "kind": "physics"}], 
		"脚本": "JiuhuaMountainMonster", "显示名": "蘑菇精"
	}, 
	"金钱松": {
		"名字": "金钱松", "等级": 90, "生命": 4295000, "基础攻击": 21000, 
		"物防": 1100, "魔防": 1100, "暴击": 300, "闪避": 160, "幸运": 0, 
		"命中": 290, "魔抗": 0, "物穿": 900, "魔穿": 900, "暴击减免": 0, 
		"速度": 10, "视野": 820, "攻击范围": 330, "攻击欲望": 100, "回血": 0, 
		"经验": 10, "金币": 8, "掉落概率": 0, 
		"攻击": [{"name": "arrow", "power": 21000, "kind": "physics"}], 
		"脚本": "JiuhuaMountainMonster", "显示名": "金钱松"
	}, 
	"闵老护法": {
		"名字": "闵老护法", "等级": 90, "生命": 18000000, "基础攻击": 32000, 
		"物防": 4800, "魔防": 4800, "暴击": 700, "闪避": 160, "幸运": 0, 
		"命中": 480, "魔抗": 0, "物穿": 3000, "魔穿": 3000, "暴击减免": 0, 
		"速度": 9, "视野": 1200, "攻击范围": 370, "攻击欲望": 100, "回血": 0, 
		"经验": 100, "金币": 280, "掉落概率": 0, 
		"攻击": [
			{"name": "藤甲护体", "power": 0, "kind": ""}, 
			{"name": "荡尽诸邪", "power": 32000, "kind": "physics"}, 
			{"name": "生灭一击", "power": 16000, "kind": "magic"}
		], "脚本": "JiuhuaMountainMonster", "显示名": "闵老护法"
	}, 
	"qiongqi": {
		"名字": "穷奇", "等级": 40, "生命": 2000000, "攻击间隔": 200, 
		"物防": 177, "魔防": 177, "暴击": 70, "闪避": 20, "幸运": 10, 
		"命中": 100, "魔抗": 0, "物穿": 0, "魔穿": 0, "暴击减免": 0, 
		"速度": 15, "视野": 1000, "攻击范围": 200, "攻击欲望": 95, "回血": 0, 
		"经验": 3500, "金币": 2000, "掉落概率": 0, 
		"攻击": [
			{"name": "近身攻击", "power": 800, "kind": "物理"}, 
			{"name": "冲撞", "power": 600, "kind": "魔法"}, 
			{"name": "地面法术", "power": 600, "kind": "魔法"}
		], "脚本": "QiongQiBoss", "显示名": "穷奇"
	}, 
	"taowu": {
		"名字": "梼杌", "等级": 40, "生命": 2500000, "攻击间隔": 250, 
		"物防": 200, "魔防": 200, "暴击": 55, "闪避": 15, "幸运": 10, 
		"命中": 100, "魔抗": 0, "物穿": 0, "魔穿": 0, "暴击减免": 0, 
		"速度": 15, "视野": 1000, "攻击范围": 250, "攻击欲望": 95, "回血": 0, 
		"经验": 500, "金币": 2000, "掉落概率": 0.5, 
		"攻击": [
			{"name": "魔法攻击", "power": 800, "kind": "魔法"}, 
			{"name": "减速攻击", "power": 800, "kind": "物理"}, 
			{"name": "毒雾攻击", "power": 800, "kind": "魔法"}, 
			{"name": "远程魔法", "power": 800, "kind": "魔法"}
		], "脚本": "TaoWuBoss", "显示名": "梼杌"
	}, 
	"hundun": {
		"名字": "混沌", "等级": 40, "生命": 2500000, "攻击间隔": 250, 
		"物防": 233, "魔防": 233, "暴击": 55, "闪避": 15, "幸运": 10, 
		"命中": 100, "魔抗": 0, "物穿": 0, "魔穿": 0, "暴击减免": 0, 
		"速度": 15, "视野": 1000, "攻击范围": 250, "攻击欲望": 95, "回血": 0, 
		"经验": 500, "金币": 2000, "掉落概率": 0.5, 
		"攻击": [
			{"name": "近身攻击", "power": 1500, "kind": "物理"}, 
			{"name": "冲撞吸血", "power": 800, "kind": "物理"}, 
			{"name": "魔法攻击", "power": 800, "kind": "魔法"}
		], "脚本": "HunDunBoss", "显示名": "混沌"
	}, 
	"taotie": {
		"名字": "饕餮", "等级": 40, "生命": 3000000, "攻击间隔": 250, 
		"物防": 250, "魔防": 250, "暴击": 55, "闪避": 15, "幸运": 10, 
		"命中": 100, "魔抗": 0, "物穿": 0, "魔穿": 0, "暴击减免": 0, 
		"速度": 15, "视野": 1000, "攻击范围": 250, "攻击欲望": 95, "回血": 0, 
		"经验": 500, "金币": 2000, "掉落概率": 0, 
		"攻击": [
			{"name": "普通魔法", "power": 1400, "kind": "魔法"}, 
			{"name": "吞噬牵引", "power": 1200, "kind": "物理"}, 
			{"name": "四方魔法", "power": 1500, "kind": "魔法"}
		], "脚本": "TaoTieBoss", "显示名": "饕餮"
	}, 
	"zxjboss": {
		"名字": "诛仙剑", "等级": 65, "生命": 2400000, "攻击间隔": 120, 
		"物防": 260, "魔防": 260, "暴击": 35, "闪避": 8, "幸运": 10, 
		"命中": 100, "魔抗": 0, "物穿": 0, "魔穿": 0, "暴击减免": 15, 
		"速度": 10, "视野": 1000, "攻击范围": 230, "攻击欲望": 95, "回血": 0, 
		"经验": 4500, "金币": 2400, "掉落概率": 15, 
		"攻击": [
			{"name": "hit1", "power": 1300, "kind": "物理"}, 
			{"name": "hit2", "power": 1650, "kind": "魔法"}, 
			{"name": "hit3", "power": 2100, "kind": "魔法"}
		], "脚本": "Monster_951", "显示名": "诛仙剑"
	}, 
	"xxjboss": {
		"名字": "陷仙剑", "等级": 65, "生命": 2800000, "攻击间隔": 120, 
		"物防": 260, "魔防": 260, "暴击": 35, "闪避": 8, "幸运": 10, 
		"命中": 100, "魔抗": 0, "物穿": 0, "魔穿": 0, "暴击减免": 15, 
		"速度": 10, "视野": 1000, "攻击范围": 230, "攻击欲望": 95, "回血": 0, 
		"经验": 4500, "金币": 2400, "掉落概率": 15, 
		"攻击": [
			{"name": "hit1", "power": 1150, "kind": "物理"}, 
			{"name": "hit2", "power": 1800, "kind": "魔法"}, 
			{"name": "hit3", "power": 2300, "kind": "魔法"}
		], "脚本": "Monster_952", "显示名": "陷仙剑"
	}, 
	"lxjboss": {
		"名字": "戮仙剑", "等级": 65, "生命": 2600000, "攻击间隔": 120, 
		"物防": 260, "魔防": 260, "暴击": 35, "闪避": 8, "幸运": 10, 
		"命中": 100, "魔抗": 0, "物穿": 0, "魔穿": 0, "暴击减免": 15, 
		"速度": 10, "视野": 1000, "攻击范围": 230, "攻击欲望": 95, "回血": 0, 
		"经验": 4500, "金币": 2400, "掉落概率": 15, 
		"攻击": [
			{"name": "hit1", "power": 1250, "kind": "物理"}, 
			{"name": "hit2", "power": 1700, "kind": "魔法"}, 
			{"name": "hit3", "power": 2200, "kind": "魔法"}
		], "脚本": "Monster_953", "显示名": "戮仙剑"
	}, 
	"jxjboss": {
		"名字": "绝仙剑", "等级": 65, "生命": 2600000, "攻击间隔": 120, 
		"物防": 260, "魔防": 260, "暴击": 35, "闪避": 8, "幸运": 10, 
		"命中": 100, "魔抗": 0, "物穿": 0, "魔穿": 0, "暴击减免": 15, 
		"速度": 10, "视野": 1000, "攻击范围": 230, "攻击欲望": 95, "回血": 0, 
		"经验": 4500, "金币": 2400, "掉落概率": 15, 
		"攻击": [
			{"name": "hit1", "power": 1250, "kind": "物理"}, 
			{"name": "hit2", "power": 1700, "kind": "魔法"}, 
			{"name": "hit3", "power": 2200, "kind": "魔法"}
		], "脚本": "Monster_954", "显示名": "绝仙剑"
	}
}

const MISSING = {}
